Repository: aytvill/ubuntu-mate.org
Catalog: _i18n/*/2019-10-18-ubuntu-mate-eoan.po
Languages: ru

source: title: Ubuntu MATE 19.10 Release Notes
ru: title: Примечания к выпуску Ubuntu MATE 19.10

source: **Ubuntu MATE 19.10 is a significant improvement over Ubuntu MATE 18.04 and 19.04. The theme of this release is to address as many *"paper-cut"* issues as possible. Every new feature in Ubuntu MATE 19.10 has been added to address bugs or poor user experience. Many long standing paper-cuts are finally resolved. Make yourself a cup of tea ☕ and get a slice of cake 🍰 before reading on to find out what we've been working on for the last 25 weeks.**
ru: **Ubuntu MATE 19.10 содержит множество улучшений относительно Ubuntu MATE 18.04 и 19.04. Темой этой версии стало исправление как можно большего количества *"неточностей"*. Каждая новая функция в Ubuntu MATE 19.10 была добавлена для устранения ошибок или улучшения взаимодействия с пользователем. Наконец-то разрешены многие давние неточности. Сделайте себе чашку чая ☕ и возьмите кусок торта 🍰 прежде чем читать дальше, чтобы узнать, над чем мы работали последние 25 недель.

source: {:.center} ![Ubuntu MATE 19.10 Beta](/images/blog/eoan/eoan-ermine-desktop.png) **_Harder, Better, Faster, Stronger_**
ru: {:.center} ![Ubuntu MATE 19.10 Beta](/images/blog/eoan/eoan-ermine-desktop.png) **_Тверже, лучше, быстрее, сильнее_**

source: # Ubuntu MATE 19.10 - paper 🧻 cut ️🔪 release
ru: # Ubuntu MATE 19.10 - релиз устранения 🧻 неточностей ️🔪

source: I have not been completely happy 😞 with the quality of recent Ubuntu MATE releases. All the important stuff works but there have been niggly issues that by themselves are not deal breakers, but in aggregate are frustrating 😠 and spoil the experience. I've been focused on resolving these issues during the 19.10 development cycle and you'll see that every new feature in Ubuntu MATE 19.10 addresses one of these paper-cuts. We've achieved this by expanding our QA team significantly and Ubuntu MATE 19.10 has been subject to weekly testing throughout this cycle. I can't thank our QA team enough for highlighting the issues that need attention.
ru: Я не совсем доволен 😞 качеством последних выпусков Ubuntu MATE. Все важные вещи работают, но были мелкие проблемы, которые сами по себе были не сильно заметны, но в совокупности разочаровывали и портили 😠 впечатление. Я сосредоточился на решении этих проблем в течение цикла разработки версии 19.10, и вы сможете убедиться, что каждая новая функция в Ubuntu MATE 19.10 решает одну из этих неточностей. Мы достигли этого благодаря значительному расширению нашей команды тестировщиков QA, которая выполняла еженедельное тестирование Ubuntu MATE 19.10 на протяжении всего этого цикла. Я не могу достаточно отблагодарить нашу команду QA за то, что они выделили вопросы, требующие внимания.

source: Most of **the paper-cut effort has been focused around the window manager, the panel and the indicators** as these are the main touching points of the desktop environment that users interact with.
ru: Большинство **задач по устранению неточностей было сосредоточено на менеджере окон, панелях и индикаторах**, поскольку это основные точки взаимодействия пользователей со средой рабочего стола.

source: Upstream [MATE Desktop](https://mate-desktop.org) recently released 1.22.2. All the updates are present in Ubuntu MATE 19.10 plus I've cherry 🍒 picked a good deal of fixes from MATE Desktop development snapshots. In total, 67 additional patches have been applied to the MATE Desktop packages in Ubuntu MATE 19.10 to finesse this release prior to launch day 🚀 Included in those patches are fixes for **locking the screen on resume from suspend**, adding a **Media Information extension to the file manager**, **performance improvements for the window manager** and **cycling external displays using** <kbd>Super</kbd> + <kbd>p</kbd>. All this work has also been submitted to [Debian](https://www.debian.org/).
ru: Недавно [рабочий стол MATE](https://mate-desktop.org) был обновлен до версии 1.22.2. Все обновления присутствуют в Ubuntu MATE 19.10, кроме того я выбрал 🍒 много исправлений из находящегося в разработке кода рабочего стола MATE. В общей сложности, 67 дополнительных исправлений для пакетов рабочего стола MATE было применено в Ubuntu MATE 19.10 для его улучшения до дня выпуска 🚀 . В эти исправления включены исправления для **блокировки экрана при пробуждении из сна**, добавление **расширения файлового менеджера для медиафайлов**, **улучшение производительности для менеджера окон** и **циклического переключения внешних экранов с помощью** <kbd>Super</kbd> + <kbd>p</kbd>. Вся эта работа также была отправлена в [Debian](https://www.debian.org/).

source: **Since the final beta we worked on the following**:
ru: **Начиная с финальной бета-версии, мы работали над следующими**

source: * Added *experimental* ZFS 🗄 install option. * Fixed rendering window controls on HiDPI 🔍 displays. * Fixed irregular icon sizes 📏 in MATE Control Center and made them render nicely on HiDPI displays. * Fixed Caja 📂 extensions not loading. * Fixed `mate-power-manager` 🔌 so it uses upower-glib `get_devices2()`. * Fixed Pluma 🗒 plugins not loading. * Fixed a crasher 💣 in MATE Dock Applet due to an Attribute error in `adjust_minimise_pos()`. * Fixed a `gnome-keyring` timeout ⏱ in `mate-session-manager`. * Fixed Codec 🎞 updates in Software Boutique. * Updated Advanced MATE Menu ⚙ to use the `start-here` icon, so all menus are consistent. * Updated the Ubuntu MATE Guide ❓ * Updated the Ubiquity Slideshow 🎭
ru: * Добавление *экспериментальной* возможности установки на ZFS 🗄 . * Исправление отображения элементов управления окнами на экранах высокого разрешения (HiDPI) 🔍. * Исправление нестандартных размеров пиктограмм 📏 в Центре управления MATE и улучшение из отображения на экранах HiDPI. * Исправление проблем с загрузкой расширений файлового менеджера Caja 📂 . * Ипсравление `mate-power-manager` 🔌 - теперь он использует upower-glib `get_devices2()`. * Исправление проблем с загрузкой плагинов текстового редактора Pluma 🗒 . * Исправление сбоя 💣 в апплете дока MATE из-за ошибки атрибута в `adjust_minimise_pos()`. * Исправление временной задержки ⏱ в `gnome-keyring` и `mate-session-manager`. * Исправление обновления кодеков 🎞 в Магазине программного обеспечения (Software Boutique). * Обновление расширенного меню MATE ⚙ для использования пиктограммы `start-here`, обеспечив единый стиль всех меню. * Обновление Ubuntu MATE Guide ❓ * Обновление набора слайдов в установщике Ubiquity 🎭

source: ### Window Manager improvements
ru: ### Улучшение менеджера окон

source: Marco is the Window Manager for MATE Desktop and in Ubuntu MATE 19.10 it brings a number of new features and fixes.
ru: Менеджер окон рабочего стола MATE имеет название Marco и в Ubuntu MATE 19.10 он содержит множество новых функций и исправлений.

source: **XPresent support is properly fixed** which means that **screen tearing is now a thing of the past** and **invisible window corners are finally here!** Invisible window corners mean that windows can be easily resized 📏 without having to precisely grab the window corners. **HiDPI rendering improvements** fix a number of rendering problems that were present in various themes and components, **most notably windows controls are now HIDPI aware**.
ru: **Поддержка была должным образом исправлена**, что означает **уход в прошлое экранных разрывов** и **позволило окончательно задействовать невидимые углы окон!!** Применение невидимых углов окон позволяет изменять размер окна 📏 без необходимости точного попадания в из углы. **Улучшение отображения для HiDPI** позволило решить ряд проблем отображения, которые присутствовали в различных темах и компонентах, **в особенности в тех, что учитывают HIDPI**.

source: | **Before** 😢 | **After** 😀 | | ------------- | ------------ | | ![Before](/images/blog/eoan/lo-windows-controls-clip.png) | ![After](/images/blog/eoan/hi-windows-controls-clip.png)
ru: | **До** 😢 | **После** 😀 | | ------------- | ------------ | | ![До](/images/blog/eoan/lo-windows-controls-clip.png) | ![После](/images/blog/eoan/hi-windows-controls-clip.png)

source: **Alt+Tab navigation** makes it possible to traverse the application switcher via keyboard and mouse. We've also **cleaned up the window controls** by removing the menu button. The menu is still available either by right clicking the window title bar or pressing <kbd>Alt</kbd> + <kbd>Space</kbd>.
ru: **Навигация с помощью Alt+Tab** позволяет перемещаться по переключателю приложений с помощью клавиатуры и мыши. Мы также **очистили элементы управления окнами** путем удаления кнопки меню. Само меню по-прежнему доступно по правому щелчку мыши или по нажатию сочетания клавиш <kbd>Alt</kbd> + <kbd>Space</kbd>.

source: ### Compiz & Compton
ru: ### Compiz и Compton

source: The main reason we've been shipping shipping Compton and Compiz in Ubuntu MATE was to offer a solution to screen tearing or improve game performance. Compiz has invisible window borders and also has a great screen magnifier suitable for visually impaired users. However, now that...
ru: Основной причиной поставки Compton и Compiz в Ubuntu MATE было решение проблемы с разрывами экрана и повышение производительности в играх. Compiz предоставляет невидимые границы окон и удобную экранную лупу, хорошо подходящую для людей с проблемами зрения. Однако теперь, когда...

source: * Magnus (see below) provides screen magnification * Marco supports invisible windows borders * Marco has improved Alt+Tab behaviour * Marco is free from screen tearing * Marco frame performance when gaming is further improved * Using Compton and Compiz with MATE Desktop introduces other bugs and integration issues
ru: * Magnus (смотрите ниже) предоставляет увеличение экрана * Marco поддерживает невидимые границы окон * Marco предоставляет улучшенное поведение Alt+Tab * Marco больше не имеет проблем с экранными разрывами * Marco имеет улучшенную кадровую производительность для игр * Использование Compton и Compiz с рабочим столом MATE создает другие ошибки и проблемы интеграции

source: ...it is **time to remove Compiz and Compton from the default Ubuntu MATE install**. The fundamental reasons for including them no longer exist.
ru: ...пришло время **удалить Compiz и Compton из стандартной поставки Ubuntu MATE**. Основных причин для их включения больше не существует.

source: If you love 😍 Compiz, it can be installed by opening a terminal and running the following command:
ru: Если вы любите 😍 Compiz, то он по-прежнему может быть установлен из терминала с помощью следующей команды:

source: Only having one window manager to target means we can promptly deliver new features and minimise development effort. Which brings us to...
ru: Наличие только одного оконного менеджера означает, что мы можем оперативно предоставлять новые функции и минимизировать усилия по разработке. Что подводит нас к ...

source: ### New Key-bindings
ru: ### Новые сочетания клавиш

source: The key-bindings for window tiling have only worked on full keyboards ⌨️ with a 10-key pad. Few laptops 💻 have a 10-key pad and not all keyboards have a 10-key either. There are some well known key-bindings from other platforms that were not recognised in Ubuntu MATE. So, we've had a think 🤔 and come up with this:
ru: Раньше сочетания клавиш для перемещения окон раньше работали только на полных клавиатурах ⌨️ with с блоком 10 цифровых клавиш. Только некоторые ноутбуки 💻 имеют такой блок из 10 клавиш, и не все клавиатуры имеют такой блок. Кроме того, на других платформах существуют хорошо известные сочетания клавиш, которые не распознаются в Ubuntu MATE. Поэтому, подумав 🤔, мы пришли к следующим сочетаниям клавиш:

source: * <b>Maximise Window:</b> <kbd>Super</kbd> + <kbd>Up</kbd> * <b>Restore Window:</b> <kbd>Super</kbd> + <kbd>Down</kbd> * <b>Title Window right:</b> <kbd>Super</kbd> + <kbd>Right</kbd> * <b>Title Window left:</b> <kbd>Super</kbd> + <kbd>Left</kbd> * <b>Center Window:</b> <kbd>Alt</kbd> + <kbd>Super</kbd> + <kbd>c</kbd> * <b>Title Window to upper right corner:</b> <kbd>Alt</kbd> + <kbd>Super</kbd> + <kbd>Right</kbd> * <b>Title Window to upper left corner:</b> <kbd>Alt</kbd> + <kbd>Super</kbd> + <kbd>Left</kbd> * <b>Title Window to lower right corner:</b> <kbd>Shift</kbd> + <kbd>Alt</kbd> + <kbd>Super</kbd> + <kbd>Right</kbd> * <b>Title Window to lower left Corner:</b> <kbd>Shift</kbd> + <kbd>Alt</kbd> + <kbd>Super</kbd> + <kbd>Left</kbd> * <b>Shade Window:</b> <kbd>Control</kbd> + <kbd>Alt</kbd> + <kbd>s</kbd>
ru: * <b>Развернуть на весь экран:</b> <kbd>Super</kbd> + <kbd>Up</kbd> * <b>Восстановить прежний размер:</b> <kbd>Super</kbd> + <kbd>Down</kbd> * <b>Переместить окно на правую половину экрана:</b> <kbd>Super</kbd> + <kbd>Right</kbd> * <b>Переместить окно на левую половину экрана:</b> <kbd>Super</kbd> + <kbd>Left</kbd> * <b>Центрировать окно:</b> <kbd>Alt</kbd> + <kbd>Super</kbd> + <kbd>c</kbd> * <b>Переместить окно в верхний правый угол:</b> <kbd>Alt</kbd> + <kbd>Super</kbd> + <kbd>Right</kbd> * <b>Переместить окно в верхний левый угол:</b> <kbd>Alt</kbd> + <kbd>Super</kbd> + <kbd>Left</kbd> * <b>Переместить окно в нижний правый угол:</b> <kbd>Shift</kbd> + <kbd>Alt</kbd> + <kbd>Super</kbd> + <kbd>Right</kbd> * <b>Переместить окно в нижний левый угол:</b> <kbd>Shift</kbd> + <kbd>Alt</kbd> + <kbd>Super</kbd> + <kbd>Left</kbd> * <b>Свернуть окно в полоску:</b> <kbd>Control</kbd> + <kbd>Alt</kbd> + <kbd>s</kbd>

source: I'm happy 😀 with these key-bindings as it is now possible to tile a window to all screen quadrants 📐 using any keyboard form factor.
ru: Я доволен 😀 этими сочетаниями клавиш, поскольку теперь можно расположить окно в любом квадранте экрана 📐 с помощью любого форм-фактора клавиатуры.

source: We updated the application launcher key-bindings, some of these have existed in Ubuntu MATE for a while:
ru: Мы обновили сочетания клавиш для запуска приложений, некоторые из которых уже давно существуют в Ubuntu MATE:

source: * <b>Cycle external displays:</b> <kbd>Super</kbd> + <kbd>p</kbd> * <b>Lock Screen:</b> <kbd>Super</kbd> + <kbd>L</kbd> * <b>Screenshot a rectangle:</b> <kbd>Shift</kbd> + <kbd>PrintScr</kbd> * <b>Open File Manager:</b> <kbd>Super</kbd> + <kbd>e</kbd> * <b>Open Terminal:</b> <kbd>Super</kbd> + <kbd>t</kbd> * <b>Open Control Center:</b> <kbd>Super</kbd> + <kbd>i</kbd> * <b>Open Search:</b> <kbd>Super</kbd> + <kbd>s</kbd> * <b>Open Task Manager:</b> <kbd>Control</kbd> + <kbd>Shift</kbd> + <kbd>Escape</kbd> * <b>Open System Information:</b> <kbd>Super</kbd> + <kbd>Pause</kbd>
ru: * <b>Переключение между внешними экранами:</b> <kbd>Super</kbd> + <kbd>p</kbd> * <b>Блокировка сеанса:</b> <kbd>Super</kbd> + <kbd>L</kbd> * <b>Экранный снимок прямоугольной области:</b> <kbd>Shift</kbd> + <kbd>PrintScr</kbd> * <b>Открытие Файлового менеджера Caja:</b> <kbd>Super</kbd> + <kbd>e</kbd> * <b>Открытие Терминала:</b> <kbd>Super</kbd> + <kbd>t</kbd> * <b>Открытие Центра управления:</b> <kbd>Super</kbd> + <kbd>i</kbd> * <b>Открытие Поиска:</b> <kbd>Super</kbd> + <kbd>s</kbd> * <b>Открытие Системного монитора:</b> <kbd>Control</kbd> + <kbd>Shift</kbd> + <kbd>Escape</kbd> * <b>Открытие информации о Системе:</b> <kbd>Super</kbd> + <kbd>Pause</kbd>

source: The key-bindings compliment existing well established alternatives. So if <kbd>Ctrl</kbd> + <kbd>Alt</kbd> + <kbd>t</kbd> (Terminal) and <kbd>Ctrl</kbd> + <kbd>Alt</kbd> + <kbd>L</kbd> (Lock Screen) are ingrained in your muscle 💪 memory 🧠 they are still available too. You can find all the keyboard shortcuts documented in the **Getting Started section of Ubuntu MATE Welcome**.
ru: Сочетания клавиш хорошо дополняют существующие хорошо зарекомендовавшие себя альтернативы. Поэтому если <kbd>Ctrl</kbd> + <kbd>Alt</kbd> + <kbd>t</kbd> (Терминал) and <kbd>Ctrl</kbd> + <kbd>Alt</kbd> + <kbd>L</kbd> (Блокировка сеанса) укоренились в вашей мышечной 💪 памяти 🧠 , то они по-прежнему доступны. Вы можете найти все сочетания клавиш в разделе документации **Начало работы внутри приложения Добро пожаловать (Ubuntu MATE Welcome)**.

source: ## Panel & Indicator improvements
ru: ## Улучшение панели и индикаторов

source: This is where a good deal of effort has been invested. Let's break it down.
ru: Здесь было вложено много усилий. Давайте разберемся с этим.

source: ### Brisk Menu and MATE Dock Applet
ru: ### Меню Brisk и MATE Dock Applet

source: [Brisk Menu](https://github.com/getsolus/brisk-menu) is under the Solus GitHub organisation, but it's been a couple of years since it had a new release. The Solus Project gave me administrative access 🔱 to the Brisk Menu repo and I've made a new release. Thanks to the efforts of a couple of Ubuntu MATE contributors several bug 🐞 fixes have landed too, which includes **resolving frequent crashers in Brisk Menu, preventing a scrollbar always appearing in the category column** of the menu and **silencing sounds firing as you rollover menu entries**.
ru: [Меню Brisk](https://github.com/getsolus/brisk-menu) находится в ведении организации Solus на GitHub, но с момента выхода новой версии прошло уже пару лет. Проект Solus предоставил мне административный доступ 🔱 к репозиторию меню Brisk, и я выпустил новую версию. Благодаря усилиям пары участников сообщества Ubuntu MATE были исправлены несколько ошибок 🐞 , в том числе **устранение частых сбоев меню Brisk, предотвращающих появление полосы прокрутки в столбце категорий** и **отключение звуков при наведении курсора мыши на пункты меню**.

source: The previous maintainer of [MATE Dock Applet](https://github.com/ubuntu-mate/mate-dock-applet) announced that he no longer had the time ⌛️ to develop the project. Ubuntu MATE has taken on ownership and we've already published a couple of new releases 🤘 which include fixes for frequent crashes.
ru: Предыдущий сопровождающий проекта [MATE Dock Applet](https://github.com/ubuntu-mate/mate-dock-applet) объявил, что у него больше нет времени ⌛️ на разработку проекта. Ubuntu MATE стал владельцем, и мы уже опубликовали пару новых выпусков 🤘, включающих исправления для частых сбоев.

source: ### MATE Panel
ru: ### Панель MATE

source: MATE Panel has had a long standing bug fixed that caused it to crash 💥 when the panel was reset or replaced. This was most noticeable when switching panel layouts via MATE Tweak and could result in the panel layout being left incomplete or entirely absent. This bug is now fixed! MATE Tweak has been updated to neatly integrate with with fixed MATE Panel behaviour so that **layout switching is now 100% reliable**.
ru: В панели MATE была исправлена давняя ошибка, приводившая к сбою 💥 при при сбросе или замене панели. Это было наиболее заметно при переключении макетов панелей с помощью MATE Tweak и могло привести к тому, что макет панели получался неполным или полностью отсутствовал. Эта ошибка исправлена! Программа MATE Tweak была для аккуратной интеграции изменений панелей MATE, так что **переключение макета теперь на 100% надежно**.

source: ### Indicators
ru: ### Индикаторы

source: A bug which resulted in **oversized icons in indicators is finally resolved**.
ru: Ошибка, приводящая к **отображению гигантских пиктограмм и индикаторов окончательноисправлена**.

source: {:.center} ![Before](/images/blog/eoan/indicators-before.png) **Before 😢**
ru: {:.center} ![До](/images/blog/eoan/indicators-before.png) **До 😢**

source: {:.center} ![After](/images/blog/eoan/indicators-after.png) **After 😀**
ru: {:.center} ![После](/images/blog/eoan/indicators-after.png) **После 😀**

source: However, it turned out some of the bugs were due to the icons 🎨 themselves. Over 💯 icons have been refactored 🖌️️ to correct their resolutions or aspect ratio; as a result the panel and indicators both scale correctly.
ru: Однако, выяснилось, что некоторые ошибки вызваны самими пиктограммами 🎨 . Более 💯 пиктограмм было переработано 🖌️️ для исправления их разрешения или соотношения сторон; в результате панель и индикаторы масштабируются прaвильно.

source: A race condition that could result in **two network status icons being displayed is fixed**, and **when connected via VPN, lock icons are now overlayed on the Network Indicator**. The battery 🔋 indicator is improved and now has a larger **charging symbol while charging**.
ru: Состояние гонки, которое могло привести к **появлению двух индикаторов состояния сети** было исправлено, и **при подключении через VPN, пиктограммы замков теперь помещаются над индикатором сети**. Индикатор батареи 🔋 улучшен - теперь он имеет **больший размер при зарядке**.

source: We've **added the Date/Time Indicator and integrated it with MATE Desktop and it now replaces the MATE clock applet** which corrects the placement of the clock and session indicators.
ru: Мы **добавили индикатор даты/времени и интегрировали его в рабочий стол MATE, теперь он заменяет апплет часов MATE**, что позволило исправить взаимное расположение часов и индикатора сессии.

source: We've finally addressed a long standing issue which has been around since Ubuntu MATE 14.10 🕸️ Some of the monochrome symbolic icons used in the indicators were also used in applications. The presented a couple of issues:
ru: Мы наконец-то решили давнюю проблему, которая существует с Ubuntu MATE 14.10 🕸️ . Некоторые монохромные символические пиктограммы, используемые в индикаторах, также использовались и в приложениях. Это создавало две следующих проблемы:

source: * In some cases you couldn't easily see the icons against the window base colour. * The mix of monochrome and full colour icons in applications looked inconsistent.
ru: * В некоторых случая вы не могли легко увидеть пиктограммы на фоне основного цвета окна. * Сочетание монохромных и полноцветных пиктограмм выглядело несовместимым.

source: This issue is now resolved, **monochrome symbolic icons are only used for indicators and full colour icons are used in the Control Center, Sound Preferences, Bluetooth, OSD, etc**.
ru: Теперь эта проблема решена, **монохромные символические пиктограммы теперь используются только в индикаторах, в то время как полноцветные - в Центре управления, настройках звука, настройках Bluetooth, OSD, и др**.

source: ### MATE Window Applets
ru: ### Оконные апплеты MATE

source: [MATE Window Applets](https://github.com/ubuntu-mate/mate-window-applets) have received a number a bug fixes and new features from a community contributor. Window control icons now dynamically load from the currently selected theme, rather than requiring manual user configuration, and **a number of bugs (including significant memory leaks) have also been resolved**.
ru: [Оконные апплеты MATE](https://github.com/ubuntu-mate/mate-window-applets) получили множество исправлений ошибок и новых функций от нашего участника сообщества. Пиктограммы элементов управления окнами теперь загружаются динамически для выбранной темы и теперь не требуют пользовательской настройки, и также **исправлено множество ошибок (включая серьезные утечки памяти)**.

source: ## Notification Center
ru: ## Центр уведомлений

source: Ubuntu MATE 19.10 includes a **new Indicator that provides a "notification center"** 🔔 We worked with the [upstream developer to add new features to indicator-notifications](https://github.com/trism/indicator-notifications) and integrate it with MATE Notifications Daemon.
ru: Ubuntu MATE 19.10 включает **новый индикатор, предоставляющий "Центр уведомлений"** 🔔 . Работа была выполнена [совместно с разработчиком indicator-notifications для добавления новых функций](https://github.com/trism/indicator-notifications) и интеграции его со службой уведомлений MATE.

source: {:.center} ![Notification Settings](/images/blog/eoan/notification-settings.png)
ru: {:.center} ![Настройки уведомлений](/images/blog/eoan/notification-settings.png)
