Repository: aytvill/ubuntu-mate.org
Catalog: _i18n/*/2019-10-18-ubuntu-mate-eoan.po
Languages: ru

source: We now have a **notification center which also offers a "do not disturb" 🛑 feature**. When do not disturb is enabled, notifications will not be displayed but will be captured in the notification center for review. It's also **possible to blacklist some notifications**, so they are never stored by the notification center. I've created an icon theme for the notification center so it fits the look and feel of the default Ubuntu MATE theme. **Notification hints are also fixed** so any notifications supplying additional media, such as sounds or icons, now work.
ru: Теперь у нас появился новый **центр уведомлений, который предоставляет функцию "не " 🛑 беспокоить**. При включение этого режима уведомления не отображаются, но сохраняются внутри центре уведомлений для последующего изучения. Также **возможно запретить вывод некоторых уведомлений**, чтобы они никогда не сохранялись в центре уведомлений. Я создал набор пиктограмм для центра уведомлений таким, чтобы он полностью визуально соответствовал теме Ubuntu MATE. **Уведомляющие подсказки также были исправлены** - теперь уведомления с дополнительными материалами, такими как звуки или пиктограммы, работают нормально.

source: Personally, I love ❤️ this feature! No more will I have awkward messages from my Mum flash up while I'm presenting 😜
ru: Мне очень нравится ❤️ эта функция! У меня больше не будет неловких сообщений от мамы, когда я веду видеотрансляцию 😜

source: ## Evolution replaces Thunderbird
ru: ## Evolution заменяет Thunderbird

source: The Ubuntu MATE development team discussed the pros and cons of switching the default mail ✉️ client in Ubuntu MATE to [Evolution](https://wiki.gnome.org/Apps/Evolution). Here is a summary of our assessment:
ru: Команда разработчиков Ubuntu MATE обсуждала положительные и отрицательные стороны изменение программы для работы с электронной почтой ✉️ по умолчанию в Ubuntu MATE на [Evolution](https://wiki.gnome.org/Apps/Evolution). Вот краткое изложение нашей оценки:

source: * Thunderbird does not integrate as well with the desktop. * For example, theme integration, font integration, compatibility with HUD (which is increasingly difficult to support in Thunderbird), notifications with action buttons, locale and spell checking. * Thunderbird & Lightning occupies 171MB on the ISO image, while Evolution uses 46MB. * Evolution integrates well with MATE Desktop given that both use GTK3. * **Evolution includes interoperability with LibreOffice**, for which Ubuntu MATE is already shipping the required components. * Evolution has superior **integration with Google Mail and Exchange**, including calendar, contacts, tasks, and memos.
ru: * Thunderbird не интегрируется с рабочим столом. * Например, интеграция темы, интеграция шрифтов, совместимость с HUD (которую становится все сложнее поддерживать в Thunderbird), уведомления с кнопками действий, проверка локали и орфографии. * Thunderbird и Lightning занимают 171 Мб внутри ISO файла, в то время как Evolution использует 46 Мб. * Evolution хорошо интегрируется с рабочим столом MATE, поскольку оба используют GTK3. * **Evolution включает взаимодействие с LibreOffice**, для которого Ubuntu MATE уже поставляет необходимые компоненты. * Evolution имеет превосходную **интеграцию с Google Mail и Exchange**, включая календарь, контакты, задачи и заметки.

source: **Indicator Date/Time also integrates with Evolution**. It is fully functional, all the features of creating new events or opening upcoming events from the indicator work. Clicking on a day in the month displays the events for the selected day etc.
ru: **Индикатор Даты/Времени также интегрируется с Evolution**. Он полностью функционален, все функции создания новых событий и открытия будущих событий работают из индикатора. Нажатие на выбранный день месяца отображает события этого дня и т.п.

source: {:.center} ![Indicator Date/Time](/images/blog/eoan/indicator-datetime.png)
ru: {:.center} ![Индикатор Даты/Времени](/images/blog/eoan/indicator-datetime.png)

source: For the many people who use web-mail exclusively this change will have no impact, but for those who use desktop mail we feel these productivity 📈 improvements are significant.
ru: Для пользователей, которые используют исключительно веб-интерфейс к почте, это изменение может остаться незамеченным, но для пользователей почтовой офисной программы эта функциональность должна существенно повысить 📈 продуктивность.

source: For those of you who love 💕 Thunderbird and wish to continue using it: we will continue to offer Thunderbird in the Software Boutique for a one-click install. Likewise, Evolution is now in the Software Boutique so can be installed/removed with one-click too.
ru: Для тех из вас, кто любит 💕 Thunderbird и хочет продолжать его использовать сообщаем: мы продолжаем предлагать Thunderbird в магазине программного обеспечения (Software Boutique) для установки в одно нажатие. Также, Evolution тоже включен в Software Boutique и может быть установлен или удален в одно нажатие.

source: ## GNOME MPV replaces VLC
ru: ## GNOME MPV заменяет VLC

source: We have **switched from VLC to GNOME MPV**, soon be renamed to [Celluloid](https://celluloid-player.github.io/), for the default media player 🎬 The reasons for switching to GNOME MPV are similar to swapping out Thunderbird for Evolution; **better desktop integration**.
ru: Мы **переключились с VLC на GNOME MPV**, который в ближайшее время будет называться [Celluloid](https://celluloid-player.github.io/), в качестве медиаплеера 🎬 по умолчанию. Причины переключения на GNOME MPV аналогичны замене Thunderbird на Evolution; **лучшая интеграция с рабочим столом**.

source: We've changed GNOME MPV's default UI to better fit in with MATE Desktop by not using client side decorations (CSD). GNOME MPV has an MPRIS implementation that completely integrates with the Sound Indicator. GNOME MPV uses less space on the ISO image compared to VLC and we'll get on to why that is important later.
ru: Мы изменили внешний вид GNOME MPV по умолчанию для лучшего соответствия виду рабочего стола MATE посредством отключение декорирование окон на стороне клиента (client side decorations - CSD). GNOME MPV поддерживает MPRIS, что позволяет его полностью интегрировать в индикатор звука. GNOME MPV использует меньше места внутри ISO образа, чем VLC, и мы разберемся дальше почему это важно.

source: GNOME MPV doesn't offer the extensive array of preferences and options to users that VLC does, and instead ships sane defaults; only surfacing options where they make sense. GNOME MPV is a GTK3 application whereas VLC uses Qt5. **GNOME MPV looks right at home in Ubuntu MATE which uses GTK3 throughout**. While we've done our best to coerce VLC to take hints from the GTK theme, it has never been perfect. Most importantly, **GNOME MPV is an excellent media player with the same broad media format support that VLC offers**. Ubuntu MATE 20.04 will ship Celluloid 🎞️, the new name for GNOME MPV. VLC will remain in the Software Boutique as a single click install for anyone who wants it.
ru: GNOME MPV не предлагает пользователям такой обширный набор настроек и опций, как VLC, а вместо этого предоставляет разумные настройки по умолчанию; предлагает настройки только там, где они имеют смысл. GNOME MPV - это приложение GTK3, тогда как VLC использует Qt5. **GNOME MPV выглядит как дома в Ubuntu MATE, который повсюду использует GTK3**. Хотя мы сделали все возможное, чтобы заставить VLC брать подсказки из темы GTK ,он никогда не был идеальным. Что наиболее важно, **GNOME MPV - отличный медиаплеер с такой же широкой поддержкой медиаформатов, что и VLC**. Ubuntu MATE 20.04 будет поставлять Celluloid 🎞️, новое название GNOME MPV. VLC останется в магазине программного обеспечения как установка в один клик для всех, кто этого захочет.

source: Most desktop environments are lacking a screen magnifier, which is an essential application for visually impaired 👓 computer users and also useful for accurate graphical design or detail work. One of the reasons we ship Compiz in Ubuntu MATE is because it has an excellent screen magnifier and was our solution for people who need magnification 🔍
ru: В большинстве сред рабочего стола отсутствует экранная лупа, которая является важным приложением для слабовидящих 👓 пользователей компьютеров, а также полезна для точного графического дизайна или работы с деталями. Одной из причин, по которой мы поставляли Compiz в Ubuntu MATE было наличие отличной экранной лупы, которая являлась хорошим решением для людей, которым требуется увеличение 🔍

source: I collaborated with my friend [Stuart Langridge](https://twitter.com/sil) to create [Magnus](https://kryogenix.org/code/magnus/); **a very simple desktop magnifier**, showing the area around the mouse pointer in a separate window magnified two, three, four, or five times. Magnus is now shipped 🚢 by default in Ubuntu MATE 19.10, Ubuntu Budgie 19.10 and other distros are already picking up it too 💪
ru: Вместе с моим другом, [Стюартом Лэнгриджем](https://twitter.com/sil) мы создали [Magnus](https://kryogenix.org/code/magnus/); **очень простую лупу для рабочего стола**, отображающее область вокруг указателя мыши в отдельном окне, с увеличением в два, три, четыре или пять раз. Теперь Magnus поставляется 🚢 по умолчанию в Ubuntu MATE 19.10, Ubuntu Budgie 19.10 и некоторые другие дистрибутивы тоже уже используют эту программу 💪.

source: ## Ubuntu MATE Themes
ru: ## Темы Ubuntu MATE

source: Dozens of theme related bugs have been fixed and the Ubuntu MATE themes have been added to the `gtk-common-themes` used by snaps, **so snapped applications are themed correctly for Ubuntu MATE users now**. This change is already available all the way back to Ubuntu MATE 16.04.
ru: Были исправлены десятки ошибок, связанных с темами, и темы Ubuntu MATE были приведены в соответствие с `gtk-common-themes`, используемыми snaps, **так что приложения snap теперь выглядят корректно для пользователей Ubuntu MATE**. Это изменение уже доступно вплоть до Ubuntu MATE 16.04.

source: The most noticeable theme issues that have been resolved are **expanders in tree view are now a sensible size** (they were so tiny) so you can easily click them, **window controls are correctly proportioned on CSD windows** and we've add a splash of Chelsea Cucumber 🥒 to the Ubuntu MATE logo on the menu. Everything the QA team highlighted has been fixed 🔨
ru: Наиболее заметные проблемы, которые были решены, - это **исправление размера расширителей в древовидном представлении** (они были просто крошечными), поэтому теперь вы можете легко по ним нажимать, **элементы управления окнами корректно отмасштабированы в CSD окнах** и мы добавили брызги Chelsea Cucumber 🥒 в логотип Ubuntu MATE в меню. Все проблемы, обнаруженные командой QA были исправлены 🔨

source: ## MATE Tweak and Ubuntu MATE Welcome
ru: ## MATE Tweak и Ubuntu MATE Welcome

source: MATE Tweak now **preserves user preferences when switching between custom layouts** thanks to a community contribution.
ru: Теперь MATE Tweak **сохраняет настройки пользователя при переключении макетов панелей** благодаря усилиям нашего сообщества.

source: If you're familiar with MATE Tweak you'll know it can switch panel layouts to somewhat mimic other platforms and distros 🐧 We have now integrated a graphical layout switcher in Ubuntu MATE Welcome to better promote the feature and make it more accessible. We have actually had this feature since 18.04 but the bugs in MATE Panel I mentioned earlier meant it didn't work. With all the associated panel bugs fixed 🔧 we now have this:
ru: Если вы знакомы с программой MATE Tweak, то вам известен способ изменения макетов панелей для визуальной имитации других платформ или дистрибутивов 🐧. Теперь мы интегрировали графический переключатель макетов панелей в приложение Ubuntu MATE Welcome для лучшего продвижения этой возможности и обеспечения ее доступности. На самом деле, у нас была эта функциональность во время выхода 18.04, но из-за ошибок в панели MATE, приведенных выше, это не работало. После исправления 🔧 всех связанных с панелями ошибок теперь у нас есть следующее:

source: {:.center} ![Desktop Layout Switcher](/images/blog/eoan/desktop-layout.png)
ru: {:.center} ![Выбор макета рабочего стола](/images/blog/eoan/desktop-layout.png)

source: ## NVIDIA drivers
ru: ## Драйверы NVIDIA

source: If you've been following the news surrounding Ubuntu you'll know that Ubuntu will be shipping 🚢 the NVIDIA proprietary drivers on the ISO images. Anyone selecting the additional 3rd party hardware drivers during installation without an Internet connection will have the drivers available in offline scenarios.
ru: Если вы следили за новостями об Ubuntu, то знаете, что Ubuntu будет поставлять 🚢 проприетарные драйверы NVIDIA внутри ISO образов. Любой, кто выберет установку дополнительных драйверов оборудования сторонних производителей во время установки без подключения к Интернету, получит драйверы, доступные в автономных сценариях.

source: This comes at the cost of increasing the ISO size by ~115MB, but I think this trade-off is worth it. The drivers are not active by default, just present in the apt repository provided on the ISO image to facilitate installation should they be requested. But, if your computer has an NVIDIA GPU, you can now have the drivers installed and operational immediately following install 🌟
ru: Это происходит за счет увеличения размера ISO на ~115 Мб, но я думаю, что этот компромисс того стоит. Драйверы по умолчанию не активны, они просто присутствуют в репозитории apt, предоставляемом в образе ISO, для облегчения установки в случае запроса. Но, если в вашем компьютере есть графический процессор NVIDIA, теперь вы можете установить драйверы и сразу же приступить к работе после установки 🌟.

source: Post-install, Ubuntu MATE users with computers that support hybrid graphics will see the MATE Optimus hybrid graphics applet displaying the NVIDIA logo.
ru: После установки пользователи Ubuntu MATE с компьютерами, поддерживающими гибридную графику, увидят апплет гибридной графики MATE Optimus с логотипом NVIDIA.

source: Now the NVIDIA 435 drivers are in Ubuntu 19.10, I have given MATE Optimus an update. MATE Optimus adds support for NVIDIA On-Demand and will now prompt users to log out when switching the GPU's profile. MATE, XFCE, Budgie, Cinnamon, GNOME, KDE and LXQt are all supported. Wrappers, called `offload-glx` & `offload-vulkan` can be used to easily offload games/apps to the PRIME renderer. **I'm also delighted to see Ubuntu Budgie 19.10 are shipping MATE Optimus too!**
ru: Теперь драйверы NVIDIA 435 присутствуют в Ubuntu 19.10, поэтому я обновил MATE Optimus. MATE Optimus добавляет поддержку NVIDIA On-Demand и теперь предлагает пользователям выйти из системы при переключении профиля графического процессора. Поддерживаются все среды рабочего стола - MATE, XFCE, Budgie, Cinnamon, GNOME, KDE и LXQt. Обертки, называемые `offload-glx` и `offload-vulkan` могут быть использованы для простой выгрузки игр или приложений в модуль рендеринга PRIME. **Я также рад видеть, что Ubuntu Budgie 19.10 тоже поставляет MATE Optimus!**

source: The **NVIDIA drivers are now going to receive updates via the official Ubuntu software repository**. So no need to add a PPA to get updates and more importantly, **the NVIDIA drivers are signed (which is not supported for drivers distributed via PPA) so you can keep Secure Boot enabled.**
ru: Драйвера **NVIDIA теперь будут получать обновления через официальный репозиторий Ubuntu**. Таким образом, не нужно добавлять в систему PPA для получения обновлений и, что более важно, **драйверы NVIDIA подписаны (что не поддерживается для драйверов распространямых через PPA), поэтому вы можете оставить режим безопасной загрузки (Secure Boot) включенным.**

source: ## ISO optimisations
ru: ## Оптимизация ISO

source: In order to squeeze those ~115MB of NVIDIA drivers on the ISO while keeping the ISO at ~2.0GB required some optimisation. Certainly switching to Evolution helped a bit. We've also **dropped Brasero from the default installed applications** because optical media burning is not a widespread use case these days. Brasero is still in Software Boutique should you need it.
ru: Чтобы уместить эти ~115 Мб драйверов NVIDIA внутри ISO, сохраняя его размер на уровне ~2.0 Гб, потребовалась некоторая оптимизация. Конечно, переход на Evolution немного помог. Мы также **исключили Brasero из установленных по умолчанию приложений**, потому что в наши дни запись на оптические носители не является широко распространенным вариантом использования. Brasero все еще доступен для установки в Software Boutique, если он вам понадобится.

source: The main gains came from **analysing the data we have about our user distribution across countries** and changing what language packs we make available on the ISO. We get the data from [snap metrics](https://snapcraft.io/ubuntu-mate-welcome) and the [Ubuntu Report](https://ubuntu.com/desktop/statistics).
ru: Основные идеи для оптимизации были получены от анализа имеющихся у нас данных о распределении пользователей по странам и изменения языковых пакетов, которые мы делаем доступными внутри ISO. Мы получаем данные из метрик [приложения snap](https://snapcraft.io/ubuntu-mate-welcome) и [отчета Ubuntu](https://ubuntu.com/desktop/statistics).

source: We dropped Chinese, Japanese and Indic language packs from the ISO and added Russian. This dropped the ISO size considerably and the savings gained were just about equivalent to what the NVIDIA drivers require.
ru: Мы удалили пакеты китайского, японского и индийского языков из ISO и добавили русский язык. Это значительно уменьшило размер ISO и полученная экономия была примерно эквивалентна тому, что требуется драйверам NVIDIA.

source: We are **currently shipping English, Spanish, Portuguese, German, French, Italian and Russian language packs on the iso**, with each language including all regional dialect variations. Anyone in other parts of the world will get the language packs providing they have an Internet connection during the install.
ru: В настоящее время мы предоставляем языковые пакеты для английского, испанского, португальского, немецкого, французского, итальянского и русского языков на ISO**, причем каждый язык включает все региональные варианты диалектов. Любой в других частях мира получит языковые пакеты при условии, что во время установки будет иметь подключение к Интернету.

source: Other gains were made by:
ru: Что еще нам помогло:

source: * Changing to format of the weather station database which saved 15MB 😱 * Removing Qt4 components. [Qt4 is being removed from Debian and Ubuntu](https://wiki.debian.org/Qt4Removal). * Removing [fcitx](https://fcitx-im.org/wiki/Fcitx) from the Live environment. * Removing obsolete software from the ship-live seed. * Removed `usb-creator-gtk` from the default install. GNOME Disks provides image writing capabilities. * Reducing the size of Ubuntu MATE Welcome and Software Boutique snaps. * Using image optimisation tools on every graphic asset in the default themes, icon themes and wallpaper back-catalog.
ru: * Изменения формата базы данных метеостанций, что сэкономило 15 Мб 😱 * Удаление компонентов Qt4. [Qt4 удаляется из Debian и Ubuntu](https://wiki.debian.org/Qt4Removal). * Удаление [fcitx](https://fcitx-im.org/wiki/Fcitx) из живого окружения. * Удвление устаревшего программного обеспечения и исходного кода из ростка ship-live. * Удаление `usb-creator-gtk` из установки по умолчанию, поскольку GNOME Disks предоставляет возможности записи образов. * Уменьшение размера snap приложений Ubuntu MATE Welcome и Software Boutique. * Использование инструментов оптимизации для всех графических изображений, включенных в темы по умолчанию, наборы пиктограмм и коллекцией фоновых рисунков рабочего стола.

source: **Had we not optimised the ISO image it would have been 2.5GB, but instead it remains just a hair over 2.0GB while now hosting the NVIDIA drivers and 7 language packs**. So, while the Ubuntu MATE ISO image is larger than some, a good chunk of that size is hosting drivers and language packs that will probably never end up getting installed on your computer. The language packs and drivers are there to best service our diverse community of users from across the world 🗺️ running a variety of hardware 💻
ru: **Если бы мы не оптимизировали размер образа ISO, то он имел бы размер 2.5 Гб, а сейчас он остается чуть больше 2.0 Гб и содержит драйверы NVIDIA вместе с 7. языковыми пакетами**. Итак, хотя ISO образ Ubuntu MATE больше некоторых, значительная часть этого размера содержит драйверы и языковые пакеты, которые, вероятно, никогда не будут установлены на вашем комьютере. Языковые пакеты и драйверы предназначены для предоставления наилучшего сервиса нашему разнообраному сообществу пользователей со всего мира 🗺️ , использующего различное оборудование 💻

source: ## ZFS on root
ru: ## ZFS для корневого раздела

# _posts/2019-10-18-ubuntu-mate-eoan.md:439
source: {:.center} ![ZFS on Linux](/images/blog/eoan/zol-logo.png)
ru: {:.center} ![ZFS на Linux](/images/blog/eoan/zol-logo.png)

source: Support for ZFS as the root filesystem is added as an experimental feature in 19.10. The ZFS file system and partitioning layout is handled automatically directly via the installer.
ru: Поддержка ZFS в качестве корневой файловой системы добавлена в качестве экспериментальной функции в 19.10. Файловая система ZFS и структура разделов формируется автоматически через установщик.

source: You can read more details on Didier Roche's blogs:
ru: Вы можете прочитать более подробную информацию в блогах Дидье Роше:

source: * [Part 1 - Ubuntu ZFS support in 19.10: introduction](https://didrocks.fr/2019/08/06/ubuntu-zfs-support-in-19.10-introduction/) * [Part 2 - Ubuntu ZFS support in 19.10: ZFS on root](https://didrocks.fr/2019/10/11/ubuntu-zfs-support-in-19.10-zfs-on-root/)
ru: * [Часть 1 - Поддержка ZFS в 19.10: введение](https://didrocks.fr/2019/08/06/ubuntu-zfs-support-in-19.10-introduction/) * [Part 2 - Поддержка ZFS в 19.10: ZFS для корневого раздела](https://didrocks.fr/2019/10/11/ubuntu-zfs-support-in-19.10-zfs-on-root/)

source: ## GPD MicroPC & other UMPCs
ru: ## GPD MicroPC и другие УМПК

source: Alongside the generic image for 64-bit Intel PCs, we're also releasing a bespoke image for the [GPD MicroPC](https://www.gpd.hk/gpdmicropc) which includes hardware specific tweaks to get this device working *"out of the box"* without any faffing about. [See our UMPC page for more details](/ports/umpcs/).
ru: Вместе с универсальным образом для 64-битных ПК Intel, мы также выпустили индивидуальные образы для [GPD MicroPC](https://www.gpd.hk/gpdmicropc) которые включают специальные аппаратные ностройки, обеспечивающие работу этих устройств *"из коробки"* без каких-либо забот. [Смотрите нашу специальную страницу о УМПК для подробностей](/ports/umpcs/).

# _posts/2019-10-18-ubuntu-mate-eoan.md:458
source: {:.center} ![ZFS on Linux](/images/blog/eoan/zol-logo.png)
ru: {:.center} ![ZFS на Linux](/images/blog/eoan/zol-logo.png)

source: ## Major Applications
ru: ## Основные программы

source: Accompanying **MATE Desktop 1.22.2** and **Linux 5.3.0** are **Firefox 69.0.1**, **GNOME MPV 0.16**, **LibreOffice 6.3.1.2** and **Evolution 3.34.0**.
ru: Дополнительно к **рабочему столу MATE версии 1.22.2** и ** ядру Linux версии 5.3.0** дистрибутив включает **Firefox 69.0.1**, **GNOME MPV 0.16**, **LibreOffice 6.3.1.2** и **Evolution 3.34.0**.

source: {:.center} ![Major Applications](/images/blog/eoan/versions.png)
ru: {:.center} ![Основные программы](/images/blog/eoan/versions.png)
