Repository: aytvill/ubuntu-mate.org
Catalog: _i18n/*/2019-10-18-ubuntu-mate-eoan.po
Languages: ru

source: See the [Ubuntu 19.10 Release Notes](https://wiki.ubuntu.com/EoanErmine/ReleaseNotes) for details of all the changes and improvements in Ubuntu that Ubuntu MATE benefits from.
ru: Смотрите [примечания к выпуску Ubuntu 19.10](https://wiki.ubuntu.com/EoanErmine/ReleaseNotes) для получения подробной информации обо всех изменениях и улучшениях в Ubuntu, от которых выигрывает Ubuntu MATE.

source: title = "Download Ubuntu MATE Today" text = "" button_text = "Download" button_url = "/download/"
ru: title = "Загрузите Ubuntu MATE сегодня" text = "" button_text = "Загрузить" button_url = "/download/"

source: ## Upgrading from Ubuntu MATE 19.04
ru: ## Обновление с версии Ubuntu MATE 19.04

source: * Open the "Software & Updates" from the Control Center. * Select the 3rd Tab called "Updates". * Set the "Notify me of a new Ubuntu version" dropdown menu to "For any new version". * Press <kbd>Alt</kbd>+<kbd>F2</kbd> and type in `update-manager -c` into the command box. * Update Manager should open up and tell you: New distribution release '19.10' is available. * If not, you can use `/usr/lib/ubuntu-release-upgrader/check-new-release-gtk` * Click "Upgrade" and follow the on-screen instructions.
ru: * Откройте "Программы и обновления" из Центра управления. * Переключитесь на третью вкладку с именем "Обновления". * В выпадающем списке "Уведомлять меня о выходе новой версии Ubuntu" выберите опцию "При доступности любой новой версии". * Нажмите сочетание клавиш <kbd>Alt</kbd>+<kbd>F2</kbd> и введите команду `update-manager -c` в текстовом поле. * Должно открыться окно Обновление приложений и вывести сообщение: Доступен выпуск Ubuntu '19.10'. * Если нет, вы можете воспользоваться командой `/usr/lib/ubuntu-release-upgrader/check-new-release-gtk` * Нажмите "Обновить" и следуйте инструкциям на экране.

source: ## Known Issues
ru: ## Известные проблемы

source: Here are the known issues.
ru: Ниже представлен список известных нам проблем.

source: * [Caja dropbox does not start](https://bugs.launchpad.net/ubuntu/+source/caja-dropbox/+bug/1845876). * The `libdropbox_apex.so` shared object, as distributed by Dropbox, has the wrong file permissions. * See [How to fix `libdropbox_apex.so` problem with latest Dropbox?](https://askubuntu.com/questions/1177519/how-to-fix-libdropbox-apex-so-problem-with-latest-dropbox). * The workaround is to open a terminal and run the following command:
ru: * [Caja dropbox не запускается](https://bugs.launchpad.net/ubuntu/+source/caja-dropbox/+bug/1845876). * Библиотека `libdropbox_apex.so`, в поставляемом Dropbox виде, имеет неверные права доступа. * Смотрите [Как исправить проблему с `libdropbox_apex.so` последней версией Dropbox?](https://askubuntu.com/questions/1177519/how-to-fix-libdropbox-apex-so-problem-with-latest-dropbox). * В качестве временного решения вы можете открыть терминал и выполнить следующую команду:

source: ### Ubuntu family issues
ru: ### Общие проблемы семейства Ubuntu

source: This is our known list of bugs that affects all flavours.
ru: Ниже представлен список проблем, затрагивающих все редакции.

source: * [Ubiquity slide shows are missing for OEM installs of Ubuntu MATE and Ubuntu Budgie](https://pad.lv/1713720) * To work around this, run `apt install oem-config-slideshow-ubuntu-mate` in the OEM prepare session.
ru: * [Наборы слайдов установщика Ubiquity в режиме OEM отсутствуют для Ubuntu MATE и Ubuntu Budgie](https://pad.lv/1713720) * В качестве временного решения для устранения этой проблемы выполните команду `apt install oem-config-slideshow-ubuntu-mate` в подготовительной OEM сессии.

source: You'll also want to check the Ubuntu MATE bug tracker to see what has already been reported. These issues will be addressed in due course.
ru: Вы также можете захотеть проверить трекер ошибок Ubuntu MATE, чтобы узнать, о каких ошибках уже было сообщено. Эти вопросы будут решены в должное время.

source: * [Ubuntu MATE Bug Tracker](https://bugs.launchpad.net/ubuntu-mate)
ru: * [трекер ошибок Ubuntu MATE](https://bugs.launchpad.net/ubuntu-mate)

source: ## Feedback
ru: ## Обратная связь

source: Is there anything you can help with or want to be involved in? Maybe you just want to discuss your experiences or ask the maintainers some questions. Please [come and talk to us](https://ubuntu-mate.community/).
ru: Есть ли что-нибудь, в чем вы можете помочь или чем хотите принять участие? Может быть, вы просто хотите обсудить свой опыт или задать несколько вопросов сопровождающим? Пожалуйста [приходите и поговорите с нами](https://ubuntu-mate.community/).
