Repository: aytvill/ubuntu-mate.org
Catalog: _i18n/*/2019-04-18-ubuntu-mate-disco-final-release.po
Languages: ru

source: title: Ubuntu MATE 19.04 Final Release
ru: title: Финальный выпуск Ubuntu 19.04

source: **Ubuntu MATE 19.04 is a modest upgrade over previous releases. If you want bug fixes and improved hardware support, *particularly for NVIDIA GPU owners*, then 19.04 is for you. Oh yeah, we've also made [bespoke Ubuntu MATE 19.04 images for the GPD Pocket and GPD Pocket 2](/ports/umpcs/). Read on to learn more...**
ru: **Ubuntu MATE 19.04 - это скромное обновление по сравнению с предыдущими версиями. Если вам нужны исправления ошибок и улучшенная поддержка оборудования, *в особенности NVIDIA GPU*, то 19.04 подходит для вас. И да, мы также подготовили [индивидуальные образы Ubuntu MATE 19.04 для GPD Pocket и GPD Pocket 2](/ports/umpcs/). Читайте дальше, чтобы узнать больше...**

source: {:.center} ![Ubuntu MATE 19.04](/images/blog/1904-final.png) **Ubuntu MATE 19.04 with the Mutiny layout**
ru: {:.center} ![Ubuntu MATE 19.04](/images/blog/1904-final.png) **Ubuntu MATE 19.04 с макетом Mutiny**

source: ## What changed since the Ubuntu MATE 18.10 final release?
ru: ## Что изменилось с относительно финальной версии Ubuntu MATE 18.10?

source: Those of you who follow the desktop Linux news will know that upstream [MATE Desktop recently released version 1.22](https://mate-desktop.org/blog/2019-03-18-mate-1-22-released/).
ru: Те из вас, кто следит за новостями Linux для персональных компьютеров, знают, что проект [рабочего стола MATE Desktop недавно выпустил версию 1.22](https://mate-desktop.org/blog/2019-03-18-mate-1-22-released/).

source: Let's rip that band-aid off and get this over quickly. Ubuntu MATE 19.04 is shipping with MATE Desktop 1.20. Albeit, the latest maintenance release of MATE Desktop 1.20 with some of the bug fixes and new features from MATE Desktop 1.22 included. In fact, the version of MATE Desktop being shipped in 19.04 is derived from the same MATE packages that will feature in the upcoming [Debian 10 (Buster)](https://wiki.debian.org/DebianBuster) release.
ru: Давайте сорвем пластырь и быстро с этим покончим. Ubuntu MATE 19.04 поставляется с рабочим столом MATE версии 1.20. Тем не менее, тем не менее, мы включили в последнюю версию рабочего стола MATE 1.20 некоторые исправления и новые возможности из версии 1.22. Фактически, версия рабочего стола MATE, включенная в 19.04 основана на тех же пакетах MATE, что и предстоящий выпуск [Debian 10 (Buster)](https://wiki.debian.org/DebianBuster).

source: You may be wondering why we're not shipping MATE Desktop 1.22? The answer, stability. MATE Desktop 1.22 introduces some underlying API changes in core components and while all first party MATE Desktop applications are compatible with the changes and completely stable, some third party applications are not. Some third party applications are big crashers now and we've not been able to fix them in time.
ru: Вам может быть интересно, почему мы не поставляем рабочий стол MATE версии 1.22? Ответ - стабильность. Рабочий стол MATE версии 1.22 представляет некоторые базовые изменения API в основных компонентах, и хотя все приложения рабочего стола MATE от сторонних производителей совместимы с изменениями и полностью стабильны, некоторые сторонние приложения - нет. Некоторые сторонние приложения сейчас вызывают большие сбои, и мы не смогли вовремя их исправить.

source: So, we are playing it safe and sticking with MATE Desktop 1.20 and working with upstreams so we can land MATE Desktop 1.22 early in the Ubuntu MATE 19.10 development cycle.
ru: Итак, мы перестраховываемся и придерживаемся рабочего стола MATE версии 1.20 и работаем с разработчиками, чтобы мы могли внедрить рабочий стол MATE версии 1.22 в начале цикла разработки Ubuntu MATE 19.10.

source: ### NVIDIA Drivers
ru: ### Драйверы NVIDIA

source: During the Ubuntu 18.10 development cycle the Linux kernel, firmware, Mesa and Vulkan were all updated to ensure we offered the best possible support for sipping AMD GPUs. During the 19.04 cycle AMD support has been uplifted again but we have also improved the *"out of box"* experience for NVIDIA GPU owners too.
ru: В течение цикла разработки Ubuntu 18.10 были обновлены ядро Linux, прошивки, Mesa и Vulkan, чтобы обеспечить наилучшую возможную поддержку для графических процессоров AMD. В течение цикла 19.04 поддержка AMD была снова улучшена, но мы также улучшили возможности *"из коробки"* для владельцев графических процессоров NVIDIA.

source: If you have an NVIDIA GPU connected to your computer and select *Install third-party software for graphics and Wi-Fi hardware* during installation, the NVIDIA proprietary drivers will be installed.
ru: Если у вас в компьютере установлен графический процессор NVIDIA и вы выберете *Установить стороннее программное обеспечение для графики и оборудования Wi-Fi* во время установки, то в систему будут установлены проприетарные драйверы NVIDIA.

source: {:.center} ![Third party drivers](/images/blog/disco/select-third-party-drivers.png)
ru: {:.center} ![Сторонние драйверы](/images/blog/disco/select-third-party-drivers.png)

source: Post install, the proprietary NVIDIA drivers are installed and configured. To confirm this, open a terminal and run `nvidia-smi`. Ubuntu MATE users with laptops that support hybrid graphics will see the MATE Optimus hybrid graphics applet displaying the NVIDIA logo.
ru: После установки проприетарные драйвера NVIDIA будут присутствовать в системе с необходимыми настройками. Чтобы проверить это, вы можете запустить терминал и выполнить команду `nvidia-smi`. При использовании Ubuntu MATE на ноутбуках с гибридной графикой на панели MATE появится апплет гибридной графики MATE Optimus с логотипом NVIDIA.

source: {:.center} ![MATE Optimus - hybrid graphics switcher](/images/blog/disco/mate-optimus-indicator.png)
ru: {:.center} ![MATE Optimus - переключатель гибридной графики](/images/blog/disco/mate-optimus-indicator.png)

source: ### MATE Dock Applet
ru: ### Апплет дока MATE

source: [MATE Dock Applet](https://github.com/robint99/mate-dock-applet) has been updated to 0.88 which introduces some new visual options, based on the look of the Unity desktop. As seen in the screenshot at the start of this post, this has been used in the Mutiny layout to further mimic Unity 7.
ru: [Апплет дока MATE](https://github.com/robint99/mate-dock-applet) обновлен до версии 0.88, в которой представлены некоторые новые визуальные настройки, основанные на внешнем виде рабочего стола Unity. Как видно на экранном снимке выше, их можно использовать, чтобы сделать макет Mutiny еще более похожим на Unity 7.

source: Our MATE Desktop 1.20 packages ship with patches to support [Remote Desktop Awareness (RDA)](https://github.com/ArcticaProject/librda). RDA makes MATE Desktop more aware of its execution context so that it behaves differently when run inside a remote desktop session compared to when running on local hardware. Different remote technology solutions support different features and they can now be queried from within MATE components. The inclusion of RDA offers the option to suspend your remote connection; supports folder sharing in Caja; MIME type bindings for SSHFS shares and allows session suspension via the MATE screensaver.
ru: Наши пакеты рабочего стола MATE версии 1.20 поставляются с исправлениями для поддержки осведомленности об использовании удаленного рабочего стола - [Remote Desktop Awareness (RDA)](https://github.com/ArcticaProject/librda). RDA делает рабочий стол MATE более осведомленным о контексте выполнения, поэтому при запуске в сеансе удаленного рабочего стола он ведет себя иначе, чем при работе на локальном оборудовании. Различные технологические решения для удаленной работы поддерживают разные функции, и теперь их можно запрашивать из компонентов MATE. Включение RDA предлагает возможность приостановить удаленное соединение, поддерживает совместное использование папок в Caja, привязку типов MIME для общих ресурсов SSHFS и позволяет приостановить сеанс с помощью экранной заставки MATE.

source: Alongside the generic image for 64-bit Intel PCs, we're also releasing bespoke images for the [GPD Pocket](https://www.gpd.hk/gpdpocket) and [GPD Pocket 2](https://www.gpd.hk/gpdpocket2). These include hardware specific tweaks to get these devices working *"out of the box"* without any faffing about. [See our GPD Pocket page for more details](/ports/umpcs/).
ru: Вместе с универсальным установочным образом для 64-битных ПК Intel, мы также выпустили индивидуальные образы для [GPD Pocket](https://www.gpd.hk/gpdpocket) и [GPD Pocket 2](https://www.gpd.hk/gpdpocket2). Они включают специальные аппаратные настройки, обеспечивающие работу этих устройств "* без каких-либо забот. [Смотрите нашу специальную страницу GPD Pocket чтобы узнать подробности](/ports/umpcs/).

source: ## Major Applications
ru: ## Основные программы

source: Accompanying **MATE Desktop 1.20.4** and **Linux 5.0.0** are **Firefox 66.0.3**, **VLC 3.0.6**, **LibreOffice 6.2.2.2** and **Thunderbird 60.6.1**.
ru: Дополнительно к **рабочему столу MATE версии 1.20.4** и **ядру Linux версии 5.0.0** дистрибутив включает **Firefox 66.0.3**, **VLC 3.0.6**, **LibreOffice 6.2.2.2** и **Thunderbird 60.6.1**.

source: {:.center} ![Major Applications](/images/blog/disco/versions.png)
ru: {:.center} ![Основные программы](/images/blog/disco/versions.png)

source: See the [Ubuntu 19.04 Release Notes](https://wiki.ubuntu.com/DiscoDingo/ReleaseNotes) for details of all the changes and improvements in Ubuntu that Ubuntu MATE benefits from.
ru: Смотрите [примечания к выпуску Ubuntu 19.04](https://wiki.ubuntu.com/DiscoDingo/ReleaseNotes) для получение подробной информации обо всех изменениях и улучшениях в Ubuntu, от которых выигрывает Ubuntu MATE.

source: ## Upgrading from Ubuntu MATE 18.04 or 18.10
ru: ## Обновление с версий Ubuntu MATE 18.04 или 18.10

source: * Open the "Software & Updates" from the Control Center. * Select the 3rd Tab called "Updates". * Set the "Notify me of a new Ubuntu version" dropdown menu to "For any new version". * Press <kbd>Alt</kbd>+<kbd>F2</kbd> and type in `update-manager -c` into the command box. * Update Manager should open up and tell you: New distribution release '19.04' is available. * If not, you can use `/usr/lib/ubuntu-release-upgrader/check-new-release-gtk` * Click "Upgrade" and follow the on-screen instructions.
ru: * Откройте "Программы и обновления" из Центра управления. * Переключитесь на третью вкладку с именем "Обновления". * В выпадающем списке "Уведомлять меня о выходе новой версии Ubuntu" выберите опцию "При доступности любой новой версии". * Нажмите сочетание клавиш <kbd>Alt</kbd>+<kbd>F2</kbd> и введите команду `update-manager -c` в текстовом поле. * Должно открыться окно Обновление приложений и вывести сообщение: Доступен выпуск Ubuntu '19.04'. * Если нет, вы можете воспользоваться командой `/usr/lib/ubuntu-release-upgrader/check-new-release-gtk` * Нажмите "Обновить" и следуйте инструкциям на экране.

source: ## Known Issues
ru: ## Известные проблемы

source: Here are the known issues.
ru: Ниже представлен список известных нам проблем.

source: * Nothing significant.
ru: * Ничего серьезного.

source: ### Ubuntu family issues
ru: ### Общие проблемы семейства Ubuntu

source: This is our known list of bugs that affects all flavours.
ru: Ниже представлен список проблем, затрагивающих все редакции.

source: * When [selecting third-party drivers during install causes a long pause before the install proceeds](https://pad.lv/1824905). * This is the `ubuntu-drivers` tool refreshing it's cache. Please wait a couple of minutes and the install will continue normally. * [Ubiquity slide shows are missing for OEM installs of Ubuntu MATE and Ubuntu Budgie](https://pad.lv/1713720) * To work around this, run `apt install oem-config-slideshow-ubuntu-mate` in the OEM prepare session.
ru: * После [выбора опции установки стороннего программного обеспечения и драйверов следует длительная пауза перед продолжением установки](https://pad.lv/1824905). * В это время утилита `ubuntu-drivers` обновляет свой кэш. Подождите пару минут и установка продолжится нормально. * [Наборы слайдов установщика Ubiquity в режиме OEM отсутствуют для Ubuntu MATE и Ubuntu Budgie](https://pad.lv/1713720) * В качестве временного решения для устранения этой проблемы выполните команду `apt install oem-config-slideshow-ubuntu-mate` в подготовительной OEM сессии.

source: You'll also want to check the Ubuntu MATE bug tracker to see what has already been reported. These issues will be addressed in due course.
ru: Вы также можете захотеть проверить трекер ошибок Ubuntu MATE, чтобы узнать, о каких ошибках уже было сообщено. Эти вопросы будут решены в должное время.

source: * [Ubuntu MATE Bug Tracker](https://bugs.launchpad.net/ubuntu-mate)
ru: * [трекер ошибок Ubuntu MATE](https://bugs.launchpad.net/ubuntu-mate)

source: ## Feedback
ru: ## Обратная связь

source: Is there anything you can help with or want to be involved in? Maybe you just want to discuss your experiences or ask the maintainers some questions. Please [come and talk to us](https://ubuntu-mate.community/).
ru: Есть ли что-нибудь, в чем вы можете помочь или чем хотите принять участие? Может быть, вы просто хотите обсудить свой опыт или задать несколько вопросов сопровождающим? Пожалуйста [приходите и поговорите с нами](https://ubuntu-mate.community/).
