Repository: aytvill/ubuntu-mate.org
Catalog: _i18n/*/2019-03-29-ubuntu-mate-bionic-raspberry-pi.po
Languages: ru

source: title: Ubuntu MATE 18.04 Beta 1 for Raspberry Pi
ru: title: Первая бета Ubuntu MATE 18.04 для Raspberry Pi

source: We are preparing **Ubuntu MATE 18.04 (Bionic Beaver) for the Raspberry Pi**. With this *Beta* pre-release, you can see what we are trying out in preparation for our next (stable) version.
ru: Мы готовим **Ubuntu MATE 18.04 (Bionic Beaver) для Raspberry Pi**. В этом *бета* пре-релизе, мы готовимся к подготовке выпуска нашей новой (стабильной) версии дистрибутива.

source: {:.center} ![Ubuntu MATE running on the Raspberry Pi 3+](/images/blog/Screenshots/09_raspberrypi.png)
ru: {:.center} ![Ubuntu MATE работает на Raspberry Pi 3+](/images/blog/Screenshots/09_raspberrypi.png)

source: Ubuntu MATE 18.04 Beta 1 is available for Raspberry Pi Model B 2, 3 and 3+, with separate images for `armhf` (ARMv7 32-bit) and `arm64` (ARMv8 64-bit). We have done what we can to optimise the builds for the Raspberry Pi without sacrificing the full desktop environment Ubuntu MATE provides on PC. High-level features of these images are:
ru: Ubuntu MATE 18.04 Beta 1 доступен для Raspberry Pi Model B 2, 3 и 3+, в виде отдельных образов для `armhf` (ARMv7 32-бит) и `arm64` (ARMv8 64-бит). Мы постарались сделать все возможное для сохранения полноценной среды рабочего стола на Raspberry Pi в том же виде, что Ubuntu MATE предоставляет на ПК. Основные возможности образов следующие:

source: * Ubuntu kernel, fully maintained by the Ubuntu Kernel and Security teams. * Automatic online filesystem expansion. * Ethernet & WiFi (*where available*) * Bluetooth (*where available*) * Audio out via 3.5mm analog audio jack or HDMI * Video out via Composite or HDMI * GPIO access via [GPIO Zero](https://gpiozero.readthedocs.io), [pigpio](http://abyz.me.uk/rpi/pigpio/) and [WiringPi](http://wiringpi.com/). * Support for [Python Wheels for the Raspberry Pi](https://www.piwheels.org/). * Support for [USB Booting](https://www.raspberrypi.org/documentation/hardware/raspberrypi/bootmodes/msd.md). * Hardware acceleration: * `fbturbo` driver is pre-installed but limited to 2D accelerated window moving/scrolling on Raspberry Pi (using the BCM2835 DMA Controller). * VLC has hardware assisted video decoding. * `ffmpeg` has hardware assisted video decoding and encoding. * The *experimental* VC4 driver can be enabled via `raspi-config`. * Please note, the `arm64` images do not feature any VideoCore IV hardware acceleration. * Additional software: * A port of [`raspi-config` for Ubuntu](https://github.com/flexiondotorg/raspi-config/) is pre-installed. * [Steam Link](https://support.steampowered.com/kb_article.php?ref=6153-IFGH-6589) is available for install. * [Minecraft: Pi Edition](https://projects.raspberrypi.org/en/projects/getting-started-with-minecraft-pi) is available for install.
ru: * Ядро из Ubuntu kernel, полностью поддерживаемое командами разработки Ubuntu Kernel и Ubuntu Security. * Автоматическое расширение файловой системы при первом включении. * Ethernet и WiFi (*при наличии*) * Bluetooth (*при наличии*) * Выход аудио через аналоговый разъем 3.5 мм или HDMI * Композитный видео-выход или HDMI * Доступ к GPIO через [GPIO Zero](https://gpiozero.readthedocs.io), [pigpio](http://abyz.me.uk/rpi/pigpio/) и [WiringPi](http://wiringpi.com/). * Поддержка [Python Wheels для Raspberry Pi](https://www.piwheels.org/). * Поддержка [загрузки с USB](https://www.raspberrypi.org/documentation/hardware/raspberrypi/bootmodes/msd.md). * Аппаратное ускорение: * драйвер `fbturbo` предустановлен, но его функциональность ограничена двумерным графическим ускорением перемещения/скроллинга окон на Raspberry Pi (используется контроллер DMA BCM2835). * VLC использует аппаратное ускорение для декодирования. * `ffmpeg` использует аппаратное ускорение для кодирования и декодирования. * *Экспериментальный* драйвер VC4 может быть включен через `raspi-config`. * Пожалуйста учтите, что образы `arm64` не предоставляют возможность любого аппаратного ускорения через VideoCore IV. * Дополнительное программное обеспечение: * Порт [`raspi-config` для Ubuntu](https://github.com/flexiondotorg/raspi-config/) предустановлен. * [Steam Link](https://support.steampowered.com/kb_article.php?ref=6153-IFGH-6589) доступен для установки. * [Minecraft: Pi Edition](https://projects.raspberrypi.org/en/projects/getting-started-with-minecraft-pi) доступен для установки.

source: ## Supported Raspberry Pi
ru: ## Поддерживаемые Raspberry Pi

source: * These images will work on: * [Raspberry Pi 2 Model B](https://www.raspberrypi.org/products/raspberry-pi-2-model-b/) * [Raspberry Pi 3 Model B](https://www.raspberrypi.org/products/raspberry-pi-3-model-b/) * [Raspberry Pi 3 Model B+](https://www.raspberrypi.org/products/raspberry-pi-3-model-b-plus/) **(recommended)**
ru: * Эти образы работают на: * [Raspberry Pi 2 Model B](https://www.raspberrypi.org/products/raspberry-pi-2-model-b/) * [Raspberry Pi 3 Model B](https://www.raspberrypi.org/products/raspberry-pi-3-model-b/) * [Raspberry Pi 3 Model B+](https://www.raspberrypi.org/products/raspberry-pi-3-model-b-plus/) **(рекомендуется)**

source: * These images *kind of* work on: * [Raspberry Pi 3 Model A+](https://www.raspberrypi.org/products/raspberry-pi-3-model-a-plus/) **(not recommended)** * Fails to complete the first boot setup due to insufficient memory. * If you have completed the setup on another Pi that card can be inserted in a Pi 3 Model A+ and it will work. * Due to only having 512MB RAM the `arm64` is not recommended. The `armhf` version can be very tight on resources.
ru: * Эти образы *почти работают* на: * [Raspberry Pi 3 Model A+](https://www.raspberrypi.org/products/raspberry-pi-3-model-a-plus/) **(не рекомендуется)** * Невозможно завершить настройку при первой загрузке из-за недостатка памяти. * Если вы выполните первоначальную настройку на другой плате, то после этого карта памяти может быть вставлена в Pi 3 Model A+ и будет работать. * Из-за наличия только 512 Мб ОЗУ использование `arm64` не рекомендуется. Версия `armhf` может быть очень скудной по ресурсам.

source: ## Unsupported Raspberry Pi
ru: ## Неподдерживаемые Raspberry Pi

source: * These images **will not work on** any Raspberry Pi model using an ARMv6 instruction set: * [Raspberry Pi 1 Model A+](https://www.raspberrypi.org/products/raspberry-pi-1-model-a-plus/) * [Raspberry Pi 1 Model B+](https://www.raspberrypi.org/products/raspberry-pi-1-model-b-plus/) * [Raspberry Pi Zero](https://www.raspberrypi.org/products/raspberry-pi-zero/) * [Raspberry Pi Zero W](https://www.raspberrypi.org/products/raspberry-pi-zero-w/)
ru: * Эти образы **не будут работать на** любой модели Raspberry Pi, использующей набор инструкций ARMv6: * [Raspberry Pi 1 Model A+](https://www.raspberrypi.org/products/raspberry-pi-1-model-a-plus/) * [Raspberry Pi 1 Model B+](https://www.raspberrypi.org/products/raspberry-pi-1-model-b-plus/) * [Raspberry Pi Zero](https://www.raspberrypi.org/products/raspberry-pi-zero/) * [Raspberry Pi Zero W](https://www.raspberrypi.org/products/raspberry-pi-zero-w/)

source: ## Recent Changes
ru: ## Последние изменения

source: ### Ubuntu MATE 18.04.2 Beta 1 - March 24th, 2019
ru: ### Ubuntu MATE 18.04.2 Beta 1 - 24 марта 2019

source: * Fixed EGL/GLES/OpenVG libraries for VideoCore IV. * Fixed Raspberry Pi features in Ubuntu MATE Welcome. * Added hardware accelerated VLC (`armhf` only). * Added hardware accelerated ffmpeg (`armhf` only). * Enabled piwheels. * Reduced boot time, after the initial first boot setup has been completed, by ~3 seconds. * Uploaded SteamLink (`armhf` only) to the archive, not pre-installed. * Uploaded Minecraft Pi Edition (`armhf` only) to the archive, not pre-installed. * Raspberry Pi 3 Model A+ confirmed working, *kind of*.
ru: * Исправлены библиотеки EGL/GLES/OpenVG для VideoCore IV. * Исправлены возможности Raspberry Pi для Ubuntu MATE Welcome. * Добавлено аппаратное ускорение в VLC (только для `armhf`). * Добавлено аппаратное ускорение в ffmpeg (только для `armhf`). * Включены piwheels. * Уменьшено время загрузки после завершения мастера первоначальной настройки, примерно на ~3 секунды. * Выгружен SteamLink в архив (только для `armhf`), не предустановлен. * Выгружен Minecraft Pi Edition в архив (только для `armhf`), не предустановлен. * Подтверждена работа платы Raspberry Pi 3 Model A+, *почти*.

source: ### Ubuntu MATE 18.04.2 - March 5th, 2019
ru: ### Ubuntu MATE 18.04.2 - 5 марта 2019

source: * Fixed HDMI audio quality. * Fixed USB booting. * Fixed font caches. * Added pre-seeded snaps. * Added miscellaneous Raspberry Pi utilities. * Added EGL/GLES/OpenVG libraries for VideoCore IV. * Enabled splash screen. * Improved window manager responsiveness. * Reduced idle RAM consumption by ~30MB on arm64 and ~10MB on armhf. * Switched to the CFQ scheduler.
ru: * Улучшено качество звука через HDMI. * Исправлена загрузка с USB. * Исправлены кэши шрифтов. * Добавлены предустановленные snaps. * Добавлены различные утилиты для Raspberry Pi. * Добавлены библиотеки EGL/GLES/OpenVG для VideoCore IV. * Включена экранная заставка. * Улучшена отзывчивость оконного менеджера. * Уменьшено потребление оперативной памяти в простое - на ~30 Мб для arm64 или на ~10 Мб для armhf. * Выполнено переключение на планировщик CFQ.

source: ### Ubuntu MATE 18.04.2 Alpha 1 - March 2nd, 2019
ru: ### Ubuntu MATE 18.04.2 Alpha 1 - 2 марта 2019

source: * Initial Ubuntu MATE 18.04.2 images made available for private testing.
ru: * Первые образы Ubuntu MATE 18.04.2 доступны для приватного тестирования.

source: ## Feedback and Improvements
ru: ## Обратная связь и улучшения

source: Thse images are not official Ubuntu products and are community supported by the Ubuntu MATE team. Please post feedback and issues on the [dedicated community forum](https://ubuntu-mate.community/c/support/raspberry-pi-2).
ru: Эти образы не являются официальными продуктами Ubuntu, они поддерживаются сообществом команды Ubuntu MATE. Пожалуйста, направляйте свои отзывы и сообщения об ошибка в [специальной ветке форума сообщества](https://ubuntu-mate.community/c/support/raspberry-pi).
