Repository: aytvill/ubuntu-mate.org
Catalog: _i18n/*/2019-04-08-ubuntu-mate-update-for-gpd-pocket.po
Languages: ru

source: title: Ubuntu MATE 18.04 and 19.04 for GPD Pocket & Pocket 2
ru: title: Ubuntu MATE 18.04 и 19.04 для GPD Pocket и Pocket 2

source: Back in October 2018 the Ubuntu MATE team released bespoke images of Ubuntu MATE 18.10 for the [GPD Pocket](https://www.gpd.hk/gpdpocket) and [GPD Pocket 2](https://www.gpd.hk/gpdpocket2) that included hardware specific tweaks to get these devices working *"out of the box"* without any faffing about. **Today we are releasing Ubuntu MATE 18.04.2 and Ubuntu MATE 19.04 images for both devices**. Read on to find out more...
ru: Еще в октябре 2018 года команда Ubuntu MATE выпустила индивидуальные образы Ubuntu MATE 18.10 для [GPD Pocket](https://www.gpd.hk/gpdpocket) и [GPD Pocket 2](https://www.gpd.hk/gpdpocket2) которые включали изменения и улучшения, обеспечившие работу этих устройств *"из коробки"* без каких-либо забот. **Сегодня мы выпускаем образы Ubuntu MATE 18.04.2 и Ubuntu MATE 19.04 для обоих устройств**. Читайте дальше, чтобы узнать подробнее...

source: {:.center} ![Ubuntu MATE 18.04.2 running on the GPD Pocket (left) and 19.04 on the GPD Pocket 2 (right)](/images/blog/gpd-pockets-news.jpg) **Ubuntu MATE 18.04.2 running on the GPD Pocket (left) and 19.04 on the GPD Pocket 2 (right)**
ru: {:.center} ![Ubuntu MATE 18.04.2 работает на GPD Pocket (слева) и 19.04 на GPD Pocket 2 (справа)](/images/blog/gpd-pockets-news.jpg) **Ubuntu MATE 18.04.2 работает на GPD Pocket (слева) и 19.04 на GPD Pocket 2 (справа)**

source: # What's new?
ru: # Что нового?

source: Thanks to the recent hardware enablement stack upgrade in Ubuntu it is now possible to create images based on Ubuntu MATE 18.04.2 for the GPD Pocket and GPD Pocket 2. [These images are final and available to download now!](/download/)
ru: Благодаря недавнему обновлению стека поддержки оборудования в Ubuntu теперь стало возможным создание образов на основе Ubuntu MATE 18.04.2 для GPD Pocket и GPD Pocket 2. [Эти образы имеют статус финальных и доступны для загрузки сейчас!](/download/)

source: The Ubuntu MATE 19.04 release is just days away, so we have also prepared Ubuntu MATE 19.04 Beta images for both devices. [Also availble for download now](/download/) and you can simply collect updates to get from the beta to final release on April 18th 2019.
ru: Релиз Ubuntu MATE 19.04 состоялся несколько дней назад, поэтому мы приготовили варианты образов Ubuntu MATE 19.04 Beta для обоих устройств. [Они также доступны для загрузки сейчас](/download/) и вы можете впоследствии скачать необходимые обновления для перехода с бета-версии к финальному релизу 18 апреля 2019 года.

source: ## Improvements
ru: ## Улучшения

source: Thanks to the feedback and contributions from the community, these are the improvement we've made since the Ubuntu MATE 18.10 images were created:
ru: Благодаря отзывам нашего сообщества и его вкладу, мы имеем следующий список улучшений с момента выхода образов Ubuntu MATE 18.10:

source: * Frame buffer and Xorg display rotation now works with `modesetting` and `xorg-video-intel` display drivers. * Enabled **TearFree rendering by default**. * Updated touch screen rotation to support Xorg and Wayland. * Enabled an **emulated mouse scroll wheel**, activated by holding down the right track point button and moving the trackpoint up/down. * **GRUB is now usable post-install** for both devices!
ru: * Теперь поворот кадрового буфера и дисплея в Xorg работает для обоих драйверов - `modesetting` и `xorg-video-intel`. * Включение **рендеринга TearFree по умолчанию**. * Включение поворота сенсорного экрана в Xorg и Wayland. * Включение **эмуляции колеса прокрутки** в Xorg, включаемого при удержании правой кнопки терк-поинта и перемещения трек поинта вверх/вниз. * **GRUB может быть нормально использован после установки** для обоих устройств!

source: title = "More Details & Downloads" text = "Find out more about Ubuntu MATE for the GPD Pocket and Pocket 2. Get the downloads!" button_text = "Details & Downloads" button_url = "/ports/umpcs/"
ru: title = "Больше подробностей и загрузки" text = "Узнайте больше об Ubuntu MATE для GPD Pocket и Pocket 2. Перейдите к загрузке!" button_text = "Подробности и загрузка" button_url = "/ports/umpcs/"
