Repository: aytvill/ubuntu-mate.org
Catalog: _i18n/*/2020-04-02-ubuntu-mate-focal.po
Languages: ru

source: Ubuntu MATE 20.04 includes a **new Indicator that provides a "notification center"** :bell: We worked with the [upstream developer to add new features to indicator-notifications](https://github.com/trism/indicator-notifications) and integrate it with MATE Notifications Daemon.
ru: Ubuntu MATE 20.04 включает **новый индикатор, предоставляющий "Центр уведомлений"** :bell: . Работа была выполнена [совместно с разработчиком indicator-notifications для добавления новых функций](https://github.com/trism/indicator-notifications) и интеграции его со службой уведомлений MATE.

source: {:.center} ![Notification Settings](/images/blog/eoan/notification-settings.png)
ru: {:.center} ![Настройки уведомлений](/images/blog/eoan/notification-settings.png)

source: We now have a **notification center that also offers a "do not disturb" :red_circle: feature**. When do not disturb is enabled, notifications will be muted and captured in the notification center for review. It's also **possible to blacklist some notifications**, so they are never stored by the notification center. I've created an icon theme for the notification center so it fits the look and feel of the default Ubuntu MATE theme. **Notification hints are also fixed** so any notifications supplying additional media, such as sounds or icons, now work.
ru: Теперь у нас появился новый **центр уведомлений, который предоставляет функцию "не " :red_circle: беспокоить**. При включение этого режима уведомления не отображаются, но сохраняются внутри центре уведомлений для последующего изучения. Также **возможно запретить вывод некоторых уведомлений**, чтобы они никогда не сохранялись в центре уведомлений. Я создал набор пиктограмм для центра уведомлений таким, чтобы он полностью визуально соответствовал теме Ubuntu MATE. **Уведомляющие подсказки также были исправлены** - теперь уведомления с дополнительными материалами, такими как звуки или пиктограммы, работают нормально.

source: ## Evolution replaces Thunderbird
ru: ## Evolution заменяет Thunderbird

source: The Ubuntu MATE development team discussed the pros and cons of switching the default mail :email: client in Ubuntu MATE to [Evolution](https://wiki.gnome.org/Apps/Evolution). Here is a summary of our assessment:
ru: Команда разработчиков Ubuntu MATE обсуждала положительные и отрицательные стороны изменение программы для работы с электронной почтой :email: по умолчанию в Ubuntu MATE на [Evolution](https://wiki.gnome.org/Apps/Evolution). Вот краткое изложение нашей оценки:

source: * Thunderbird does not integrate as well with the desktop. * For example, theme integration, font integration, compatibility with HUD (which is increasingly difficult to support in Thunderbird), notifications with action buttons, locale and spell checking. * Evolution integrates well with MATE Desktop given that both use GTK3. * **Evolution includes interoperability with LibreOffice**, for which Ubuntu MATE is already shipping the required components. * Evolution has superior **integration with Google Mail and Exchange**, including calendar, contacts, tasks, and memos.
ru: * Thunderbird не интегрируется с рабочим столом. * Например, интеграция темы, интеграция шрифтов, совместимость с HUD (которую становится все сложнее поддерживать в Thunderbird), уведомления с кнопками действий, проверка локали и орфографии. * Evolution хорошо интегрируется с рабочим столом MATE, поскольку оба используют GTK3. * **Evolution включает взаимодействие с LibreOffice**, для которого Ubuntu MATE уже поставляет необходимые компоненты. * Evolution имеет превосходную **интеграцию с Google Mail и Exchange**, включая календарь, контакты, задачи и заметки.

source: **Indicator Date/Time also integrates with Evolution**. It is fully functional, including all the features of creating new events or opening upcoming events from the indicator. Clicking on an individual day in the month displays the events for that day, etc.
ru: **Индикатор Даты/Времени также интегрируется с Evolution**. Он полностью функционален, все функции создания новых событий и открытия будущих событий работают из индикатора. Нажатие на выбранный день месяца отображает события этого дня и т.п.

source: {:.center} ![Indicator Date Time](/images/blog/eoan/indicator-datetime.png)
ru: {:.center} ![Индикатор Даты/Времени](/images/blog/eoan/indicator-datetime.png)

source: For the many people who use web-mail exclusively, this change will have no impact, but for those who use desktop mail we feel these productivity :chart_with_upwards_trend: improvements are significant.
ru: Для пользователей, которые используют исключительно веб-интерфейс к почте, это изменение может остаться незамеченным, но для пользователей почтовой офисной программы эта функциональность должна существенно повысить :chart_with_upwards_trend: продуктивность.

source: For those of you who love :two_hearts: Thunderbird and wish to continue using it, we will continue to offer Thunderbird in the Software Boutique for a one-click install. Likewise, Evolution is now in the Software Boutique, and can be installed/removed with one click.
ru: Для тех из вас, кто любит :two_hearts: Thunderbird и хочет продолжать его использовать сообщаем: мы продолжаем предлагать Thunderbird в магазине программного обеспечения (Software Boutique) для установки в одно нажатие. Также, Evolution тоже включен в Software Boutique и может быть установлен или удален в одно нажатие.

source: Most desktop environments are lacking a screen magnifier, which is an essential application for visually impaired :eyeglasses: computer users, as well as accurate graphical design or detail work. One of the reasons we ship Compiz in Ubuntu MATE is because it has an excellent screen magnifier and was our solution for people who need magnification :mag:
ru: В большинстве сред рабочего стола отсутствует экранная лупа, которая является важным приложением для слабовидящих :eyeglasses: пользователей компьютеров, а также полезна для точного графического дизайна или работы с деталями. Одной из причин, по которой мы поставляли Compiz в Ubuntu MATE было наличие отличной экранной лупы, которая являлась хорошим решением для людей, которым требуется увеличение :mag:

source: {:.center} ![Magnus for zooming into the screen](/images/blog/eoan/magnus.png)
ru: {:.center} ![Magnus для увеличения области экрана](/images/blog/eoan/magnus.png)

source: Martin and [Stuart Langridge](https://twitter.com/sil) collaborated to create [Magnus](https://kryogenix.org/code/magnus/); **a very simple desktop magnifier**, showing the area around the mouse pointer in a separate window magnified two, three, four, or five times. Magnus is now shipped :ship: by default in Ubuntu MATE 20.04.
ru: Мартин и [Стюартом Лэнгриджем](https://twitter.com/sil) совместно создали [Magnus](https://kryogenix.org/code/magnus/); **очень простую лупу для рабочего стола**, отображающее область вокруг указателя мыши в отдельном окне, с увеличением в два, три, четыре или пять раз. Теперь Magnus поставляется :ship: по умолчанию в Ubuntu MATE 20.04.

source: ## Ubuntu MATE Themes
ru: ## Темы Ubuntu MATE

source: Dozens of theme-related bugs have been fixed. The Ubuntu MATE themes have been added to the `gtk-common-themes` used by snaps, **so snapped applications are now themed correctly for Ubuntu MATE users**. This change is already available all the way back to Ubuntu MATE 16.04.
ru: Были исправлены десятки ошибок, связанных с темами, и темы Ubuntu MATE были приведены в соответствие с `gtk-common-themes`, используемыми snaps, **так что приложения snap теперь выглядят корректно для пользователей Ubuntu MATE**. Это изменение уже доступно вплоть до Ubuntu MATE 16.04.

source: The most noticeable resolved theme issues are **sensibly sized expanders in tree view** (they were so tiny) that are easily clickable, **window controls are correctly proportioned on CSD windows** and we've add a splash of Chelsea Cucumber :bug: to the Ubuntu MATE logo on the menu. Everything the QA team highlighted has been fixed :hammer:
ru: Наиболее заметные проблемы, которые были решены, - это **расширители в древовидном представлении теперь имеют заметный размер** (они были просто крошечными), поэтому теперь вы можете легко по ним нажимать, **элементы управления окнами корректно отмасштабированы в CSD окнах** и мы добавили брызги Chelsea Cucumber :cucumber: в логотип Ubuntu MATE в меню. Все проблемы, обнаруженные командой QA были исправлены :hammer:

source: ## MATE Tweak and Ubuntu MATE Welcome
ru: ## MATE Tweak и Ubuntu MATE Welcome

source: MATE Tweak now **preserves user preferences when switching between custom layouts** thanks to a community contribution.
ru: Теперь MATE Tweak **сохраняет настройки пользователя при переключении макетов панелей** благодаря усилиям нашего сообщества.

source: If you're familiar with MATE Tweak, you'll know it can switch panel layouts to somewhat mimic other platforms and distros 🐧 We have now integrated a graphical layout switcher in Ubuntu MATE Welcome to better promote the feature and make it more accessible. We have actually had this feature since 18.04, but the bugs in MATE Panel I mentioned earlier meant it didn't work. With all the associated panel bugs fixed :wrench: we now have this:
ru: Если вы знакомы с программой MATE Tweak, то вам известен способ изменения макетов панелей для визуальной имитации других платформ или дистрибутивов 🐧. Теперь мы интегрировали графический переключатель макетов панелей в приложение Ubuntu MATE Welcome для лучшего продвижения этой возможности и обеспечения ее доступности. На самом деле, у нас была эта функциональность во время выхода 18.04, но из-за ошибок в панели MATE, приведенных выше, это не работало. После исправления :wrench: всех связанных с панелями ошибок теперь у нас есть следующее:

source: {:.center} ![Desktop Layout Switcher](/images/blog/eoan/desktop-layout.png)
ru: {:.center} ![Выбор макета рабочего стола](/images/blog/eoan/desktop-layout.png)

source: ## NVIDIA drivers
ru: ## Драйверы NVIDIA

source: If you've been following the news surrounding Ubuntu you'll know that Ubuntu will be shipping :ship: the NVIDIA proprietary drivers on the ISO images. Anyone selecting the additional 3rd party hardware drivers during installation without an Internet connection will have the drivers available in offline scenarios.
ru: Если вы следили за новостями об Ubuntu, то знаете, что Ubuntu будет поставлять :ship: проприетарные драйверы NVIDIA внутри ISO образов. Любой, кто выберет установку дополнительных драйверов оборудования сторонних производителей во время установки без подключения к Интернету, получит драйверы, доступные в автономных сценариях.

source: Post-install, Ubuntu MATE users with computers that support hybrid graphics will see the MATE Optimus hybrid graphics applet displaying the NVIDIA logo.
ru: После установки пользователи Ubuntu MATE с компьютерами, поддерживающими гибридную графику, увидят апплет гибридной графики MATE Optimus с логотипом NVIDIA.

source: We have given MATE Optimus an update. MATE Optimus adds support for NVIDIA On-Demand and will now prompt users to log out when switching the GPU's profile. MATE, XFCE, Budgie, Cinnamon, GNOME, KDE and LXQt are all supported. Wrappers, called `offload-glx` & `offload-vulkan`, can be used to easily offload games/apps to the PRIME renderer. **I'm also delighted to see Ubuntu Budgie 20.04 are shipping MATE Optimus too!**
ru: Мы обновили MATE Optimus. MATE Optimus добавляет поддержку NVIDIA On-Demand и теперь предлагает пользователям выйти из системы при переключении профиля графического процессора. Поддерживаются все среды рабочего стола - MATE, XFCE, Budgie, Cinnamon, GNOME, KDE и LXQt. Обертки, называемые `offload-glx` и `offload-vulkan` могут быть использованы для простой выгрузки игр или приложений в модуль рендеринга PRIME **Я также рад видеть, что Ubuntu Budgie 19.10 тоже поставляет MATE Optimus!**

source: The **NVIDIA drivers are now going to receive updates via the official Ubuntu software repository**. So no need to add a PPA to get updates and more importantly, **the NVIDIA drivers are signed (which is not supported for drivers distributed via PPA) so you can keep Secure Boot enabled.**
ru: Драйвера **NVIDIA теперь будут получать обновления через официальный репозиторий Ubuntu**. Таким образом, не нужно добавлять в систему PPA для получения обновлений и, что более важно, **драйверы NVIDIA подписаны (что не поддерживается для драйверов распространямых через PPA), поэтому вы можете оставить режим безопасной загрузки (Secure Boot) включенным.**

source: Our MATE Desktop 1.24 packages ship support for [Remote Desktop Awareness (RDA)](https://github.com/ArcticaProject/librda). RDA makes MATE Desktop more aware of its execution context, so it behaves differently when run inside a remote desktop session compared to when running on local hardware. Different remote technology solutions support different features and they can now be queried from within MATE components. The inclusion of RDA offers the option to suspend your remote connection, supports folder sharing in Caja and MIME type bindings for SSHFS shares, and allows session suspension via the MATE screensaver.
ru: Наши пакеты рабочего стола MATE версии 1.24 с для поддержкой осведомленности об использовании удаленного рабочего стола - [Remote Desktop Awareness (RDA)](https://github.com/ArcticaProject/librda). RDA делает рабочий стол MATE более осведомленным о контексте выполнения, поэтому при запуске в сеансе удаленного рабочего стола он ведет себя иначе, чем при работе на локальном оборудовании. Различные технологические решения для удаленной работы поддерживают разные функции, и теперь их можно запрашивать из компонентов MATE. Включение RDA предлагает возможность приостановить удаленное соединение, поддерживает совместное использование папок в Caja, привязку типов MIME для общих ресурсов SSHFS и позволяет приостановить сеанс с помощью экранной заставки MATE.

source: ## ZFS on root
ru: ## ZFS для корневого раздела

source: {:.center} ![ZFS on Linux](/images/blog/eoan/zol-logo.png)
ru: {:.center} ![ZFS на Linux](/images/blog/eoan/zol-logo.png)

source: Support for ZFS as the root filesystem is added as an experimental feature in 20.04. The ZFS file system and partitioning layout is handled automatically directly via the installer. `zsys` was added in 20.04 which now takes system snapshots before significant installs or upgrades and inserts restore options into the GRUB bootloader menus should you need to recover.
ru: Поддержка ZFS в качестве корневой файловой системы добавлена в качестве экспериментальной функции в 20.04. Файловая система ZFS и структура разделов формируется автоматически через установщик. Программа `zsys` была добавлена в 20.04, она предназначена для создания мгновенных снимков файловой системы перед любыми серьезными установками или обновлениями, она также добавляет специальные опции восстановления в меню загрузчика GRUB для предоставления вам возможности восстановления по требованию.

source: You can read more details on Didier Roche's blogs:
ru: Вы можете прочитать более подробную информацию в блогах Дидье Роше:

source: * [Part 1 - Ubuntu ZFS support in 19.10: introduction](https://didrocks.fr/2019/08/06/ubuntu-zfs-support-in-19.10-introduction/) * [Part 2 - Ubuntu ZFS support in 19.10: ZFS on root](https://didrocks.fr/2019/10/11/ubuntu-zfs-support-in-19.10-zfs-on-root/)
ru: * [Часть 1 - Поддержка ZFS в 19.10: введение](https://didrocks.fr/2019/08/06/ubuntu-zfs-support-in-19.10-introduction/) * [Part 2 - Поддержка ZFS в 19.10: ZFS для корневого раздела](https://didrocks.fr/2019/10/11/ubuntu-zfs-support-in-19.10-zfs-on-root/)

source: ## Major Applications
ru: ## Основные программы

source: Accompanying **MATE Desktop 1.24.0** and **Linux 5.4** are **Firefox 75.0**, **Celluloid 0.18**, **LibreOffice 6.4.2.2** and **Evolution 3.36.1**.
ru: Дополнительно к **рабочему столу MATE версии 1.24.0** и **ядру Linux версии 5.4** дистрибутив включает **Firefox 75.0**, **Celluloid 0.18**, **LibreOffice 6.4.2.2** и **Evolution 3.36.1**.

source: {:.center} ![Major Applications](/images/blog/focal/versions.png)
ru: {:.center} ![Основные программы](/images/blog/focal/versions.png)

source: See the [Ubuntu 20.04 Release Notes](https://wiki.ubuntu.com/FocalFossa/ReleaseNotes) for details of all the changes and improvements in Ubuntu that Ubuntu MATE benefits from.
ru: Смотрите [примечания к выпуску Ubuntu 20.04](https://wiki.ubuntu.com/FocalFossa/ReleaseNotes) для получения подробной информации обо всех изменениях и улучшениях в Ubuntu, от которых выигрывает Ubuntu MATE.

source: ## Upgrading from Ubuntu MATE 18.04 LTS or 19.10
ru: ## Обновление с версий Ubuntu MATE 18.04 LTS или 19.10

source: You can upgrade to Ubuntu 20.04 LTS from either Ubuntu MATE 18.04 LTS or Ubuntu 19.10. Ensure that you have all updates installed for your current version of Ubuntu MATE before you upgrade.
ru: Вы можете обновиться до Ubuntu 20.04 LTS с версии Ubuntu MATE 18.04 LTS или Ubuntu 19.10. Убедитесь, что вы установили все необходимые обновления для вашей текущей версии Ubuntu MATE перед обновлением.

source: * Open the "Software & Updates" from the Control Center. * Select the 3rd Tab called "Updates". * Set the "Notify me of a new Ubuntu version" drop down menu to "For long-term support versions" if you are using 18.04 LTS; set it to "For any new version" if you are using 19.10. * Press <kbd>Alt</kbd>+<kbd>F2</kbd> and type in `update-manager -c -d` into the command box. * Update Manager should open up and tell you: New distribution release '20.04' is available. * If not, you can use `/usr/lib/ubuntu-release-upgrader/check-new-release-gtk` * Click "Upgrade" and follow the on-screen instructions.
ru: * Откройте "Программы и обновления" из Центра управления. * Переключитесь на третью вкладку с именем "Обновления". * В выпадающем списке "Уведомлять меня о выходе новой версии Ubuntu" выберите опцию "При доступности версий с длительным сроком поддержки" если вы используете 18.04 LTS или "При доступности любой новой версии" если вы используете 19.10. * Нажмите сочетание клавиш <kbd>Alt</kbd>+<kbd>F2</kbd> и введите команду `update-manager -c -d` в текстовом поле. * Должно открыться окно Обновление приложений и вывести сообщение: Доступен выпуск Ubuntu '19.04'. * Если нет, вы можете воспользоваться командой `/usr/lib/ubuntu-release-upgrader/check-new-release-gtk` * Нажмите "Обновить" и следуйте инструкциям на экране.

source: There are no offline upgrade options for Ubuntu MATE. Please ensure you have network connectivity to one of the official mirrors or to a locally accessible mirror and follow the instructions above.
ru: Для Ubuntu MATE нет вариантов автономного обновления. Убедитесь, что у вас есть сетевое подключение к одному из официальных зеркал или к локально доступному зеркалу, и следуйте приведенным выше инструкциям.

source: ## Known Issues
ru: ## Известные проблемы

source: Here are the known issues.
ru: Ниже представлен список известных нам проблем.

source: * [Xorg crashes to Login prompt in VirtualMachines](https://bugs.launchpad.net/ubuntu/+source/xorg-server/+bug/1745345) * When `gstreamer-vaapi` is installed it will cause Xorg to crash and bring the user back to the login prompt when running certain applications. * See [Workaround for Xorg crashes to Login prompt in VirtualMachines 20.04](https://ubuntu-mate.community/t/workaround-for-xorg-crashes-to-login-prompt-in-virtualmachines-20-04/21368/2)
ru: * [Xorg падает при входе в систему на виртуальных машинах](https://bugs.launchpad.net/ubuntu/+source/xorg-server/+bug/1745345) * В случае установки пакета `gstreamer-vaapi`, он вызывает падение графического сервера Xorg и возвращает вас на экран входа при запуске некоторых приложений. * Смотрите [временное решение для устранения падения Xorg в виртуальных машинах 20.04](https://ubuntu-mate.community/t/workaround-for-xorg-crashes-to-login-prompt-in-virtualmachines-20-04/21368/2)

source: ### Ubuntu family issues
ru: ### Общие проблемы семейства Ubuntu

source: This is our known list of bugs that affects all flavours.
ru: Ниже представлен список проблем, затрагивающих все редакции.

source: * [Ubiquity slide shows are missing for OEM installs of Ubuntu MATE and Ubuntu Budgie](https://pad.lv/1713720) * To work around this, run `apt install oem-config-slideshow-ubuntu-mate` in the OEM prepare session.
ru: * [Наборы слайдов установщика Ubiquity в режиме OEM отсутствуют для Ubuntu MATE и Ubuntu Budgie](https://pad.lv/1713720) * В качестве временного решения для устранения этой проблемы выполните команду `apt install oem-config-slideshow-ubuntu-mate` в подготовительной OEM сессии.

source: You'll also want to check the Ubuntu MATE bug tracker to see what has already been reported. These issues will be addressed in due course.
ru: Вы также можете захотеть проверить трекер ошибок Ubuntu MATE, чтобы узнать, о каких ошибках уже было сообщено. Эти вопросы будут решены в должное время.

source: * [Ubuntu MATE Bug Tracker](https://bugs.launchpad.net/ubuntu-mate)
ru: * [трекер ошибок Ubuntu MATE](https://bugs.launchpad.net/ubuntu-mate)

source: ## Feedback
ru: ## Обратная связь

source: Is there anything you can help with or want to be involved in? Maybe you just want to discuss your experiences or ask the maintainers some questions. Please [come and talk to us](https://ubuntu-mate.community/).
ru: Есть ли что-нибудь, в чем вы можете помочь или чем хотите принять участие? Может быть, вы просто хотите обсудить свой опыт или задать несколько вопросов сопровождающим? Пожалуйста [приходите и поговорите с нами](https://ubuntu-mate.community/).
