Repository: aytvill/ubuntu-mate.org
Catalog: _i18n/*/2020-04-02-ubuntu-mate-focal.po
Languages: ru

source: title: Ubuntu MATE 20.04 Release Notes
ru: title: Примечания к выпуску Ubuntu MATE 20.04

source: Ubuntu MATE 20.04 LTS represents 2 years :sweat_drops: of continued improvement to [MATE Desktop](https://mate-desktop.org) and Ubuntu MATE itself. For Ubuntu MATE 19.10 we [focused on addressing as many *"paper-cut"* issues as possible](/blog/ubuntu-mate-19-10-eoan-ermine-release/). That was a hugely successful :tada: initiative, the community feedback was overwhelmingly positive :chart_with_upwards_trend: and that is reflected in adoption; **the Ubuntu MATE 19.10 interim release is our most actively used interim release to date!** :champagne: This was only possible thanks to dedicated group of QA testers [joining the Ubuntu MATE team](/about/team/) and coordinating with developers to highlight :flashlight: where attention was needed.
ru: Ubuntu MATE 20.04 LTS представляет собой 2 года непрерывного совершенствования :sweat_drops: [рабочего стола MATE](https://mate-desktop.org) и самого Ubuntu MATE. При подготовке Ubuntu MATE 19.10 мы [были сосредоточены на устранении как можно большего количества *"неточностей"*](/blog/ubuntu-mate-19-10-eoan-ermine-release/). Это была чрезвычайно успешная инициатива :tada:, отзывы сообщества были исключительно положительными :chart_with_upwards_trend: и мы учитываем это; **промежуточный выпуск Ubuntu MATE 19.10 оказался нашим наиболее активно используемым выпуском на сегодняшний день!** :champagne: Это стало возможным только благодаря нашей специальной группе QA тестировщиков, [присоединившихся к команде Ubuntu MATE](/about/team/) и координирующей действия с разработчиками, чтобы выделить :flashlight: вопросы, требующие внимания.

source: Recognising that we're on to a good thing, :thumbsup: we've repeated this trick for Ubuntu MATE 20.04 LTS by once again by focusing :eyes: on the pain points our community is most vocal :loudspeaker: about. You'll find details of everything we've improved or fixed since 19.10 plus a summary of what's changed since 18.04 below :point_down:
ru: Поняв, что мы находимся на правильном пути, :thumbsup: мы повторили этот трюк еще раз для Ubuntu MATE 20.04 LTS, сосредоточившись :eyes: на болевых точках, которые наиболее сильно :loudspeaker: беспокоят наше сообщество. Вы найдете подробную информацию обо всем, что мы улучшили или исправили с 19.10, а также обзор того, что изменилось с 18.04 в тексте ниже :point_down:

source: **I'd like to extend my sincere thanks to everyone who has played an active role in improving Ubuntu MATE for this LTS release :clap: From reporting bugs, submitting translations, providing patches, contributing to our crowd funding, developing new features, creating artwork, offering community support, actively testing and providing QA feedback to writing documentation or creating this fabulous website. Thank you! Thank you all for getting out there and making a difference!** :green_heart:
ru: **Я хотел бы выразить свою искреннюю благодарность всем, кто сыграл активную роль в улучшении Ubuntu MATE для этого выпуска с долгосрочной поддержкой (LTS) :clap: . От сообщения об ошибках, подготовки переводов, предоставления исправлений, финансовой поддержки на платформах краудфандинга, разработки новых функций, создания иллюстраций, предложения поддержки сообщества, активного тестирования и предоставления обратной связи при QA до написания документации или создания этого потрясающего веб-сайта. Спасибо вам! Благодарим вас всех за то, что вы пришли и сделали мир лучше!** :green_heart:

source: {:.center} ![Ubuntu MATE 20.04 Desktop](/images/blog/focal/focal-fossa-desktop.png) **Ubuntu MATE 20.04 - Welcome now offers a few buckets of paint!**
ru: {:.center} ![Рабочий стол Ubuntu MATE 20.04](/images/blog/focal/focal-fossa-desktop.png) **Ubuntu MATE 20.04 - приложение Welcome теперь предлагает выбор цвета!**

source: ## What changed since the Ubuntu MATE 18.04 LTS?
ru: ## Что изменилось относительно Ubuntu MATE 18.04 LTS?

source: Those of you who follow the desktop Linux news will know that upstream [MATE Desktop recently released version 1.24](https://mate-desktop.org/blog/2020-02-10-mate-1-24-released/). Ubuntu MATE 20.04 is shipping with MATE Desktop 1.24. Thus, all of the improvements in MATE Desktop 1.24 are present in Ubuntu MATE 20.04 LTS.
ru: Те из вас, кто следит за новостями Linux для персональных компьютеров, знают, что проект [рабочего стола MATE недавно выпустил версию 1.24](https://mate-desktop.org/blog/2020-02-10-mate-1-24-released/). Ubuntu MATE 20.04 поставляется с рабочим столом MATE версии 1.24. Поэтому, все улучшения рабочего стола MATE версии 1.24 доступны в Ubuntu MATE 20.04 LTS.

source: **Since the last LTS we worked on the following**:
ru: **С момента прошлого LTS выпуска вы работали над следующим**:

source: * Added multiple coloured theme variations :art: as one-click installs for those of you who simply don't like Chelsea Cucumber :cucumber: * Added *experimental* ZFS :file_folder: install option. * Added GameMode :video_game: from [Feral Interactive](https://github.com/FeralInteractive/gamemode). * Fixed several crashers :bomb: in Brisk Menu and added keyboard :keyboard: navigation. * Fixed panel layout switching :hammer_and_wrench: which is now stable and reliable via MATE Tweak Tweak and Ubuntu MATE Welcome. * Fixed rendering window controls on HiDPI :mag: displays. * Fixed irregular icon sizes :straight_ruler: in MATE Control Center and made them render nicely on HiDPI displays. * Fixed unresponsive Caja :file_folder: extensions. * Fixed `mate-power-manager` :electric_plug: to use upower-glib `get_devices2()`. * Fixed unresponsive Pluma :notebook: plugins. * Fixed a crasher :bomb: in MATE Dock Applet due to an Attribute error in `adjust_minimise_pos()`. * Fixed auto-start errors in `mate-session-manager`. * Fixed saving/restoring custom panel layouts via MATE Tweak. * Gave Ubuntu MATE Welcome a fresh coat of :paintbrush:. * Updated the Ubuntu MATE Guide :question: * Updated the Ubiquity Slideshow :performing_arts:
ru: * Добавление нескольких разноцветных тем :art:, доступных для установки одним кликом, для тех, кому просто не нравится цвет Chelsea Cucumber :cucumber: * Добавление *экспериментальной* поддержки установки на ZFS :file_folder:. * Добавление игрового режима (GameMode) :video_game: от [Feral Interactive](https://github.com/FeralInteractive/gamemode). * Исправление нескольких сбоев :bomb: в меню Brisk и добавление в него клавиатурной :keyboard: навигации. * Исправление переключения макетов панели :hammer_and_wrench:, которое теперь работает стабильно и надежно из MATE Tweak Tweak и Ubuntu MATE Welcome. * Исправление отображения элементов управления окнами на экранах высокого разрешения (HiDPI) :mag:. * Исправление нестандартных размеров пиктограмм :straight_ruler: в Центре управления MATE и улучшение их отображение на экранах HiDPI. * Исправление зависания дополнений файлового менеджера Caja :file_folder:. * Исправление `mate-power-manager` :electric_plug: - теперь он использует upower-glib `get_devices2()`. * Исправление зависания дополнений текстового редактора Pluma :notebook:. * Исправление сбоев :bomb: в апплете дока MATE из-за ошибки атрибута в `adjust_minimise_pos()`. * Исправление ошибок автоматического запуска в `mate-session-manager`. * Исправление сохрания/восстановления пользовательских макетов панелей в MATE Tweak. * Обновление внешний вид приложения Ubuntu MATE Welcome :paintbrush:. * Обновление Ubuntu MATE Guide :question: * Обновление набора слайдов в установщике Ubiquity :performing_arts:

source: ## Firmware updater
ru: ## Обновление микропрограмм

source: We've add a GTK front end for `fwupd`; this application can:
ru: Мы добавили графический интерфейс GTK для программы `fwupd`, позволяющей:

source: * Upgrade, Downgrade, & Reinstall firmware on devices supported by [Linux Vendor Firmware Service (LVFS)](https://fwupd.org/). * Unlock locked `fwupd` devices. * Verify firmware on supported devices. * Display all releases for a `fwupd` device.
ru: * Обновлять, понижать версию и переустанавливать микропрограммы на устройствах, поддерживаемых [Linux Vendor Firmware Service (LVFS)](https://fwupd.org/). * Разблокировать заблокированные `fwupd` устройства. * Верифицировать микропрограммы на поддерживаемых устройствах. * Показывать список всех версий для устройства `fwupd`.

source: {:.center} ![Firmware](/images/blog/focal/firmware.png) **Ubuntu MATE 20.04 - Features an LVFS compatible Firmware management utility**
ru: {:.center} ![Firmware](/images/blog/focal/firmware.png) **Ubuntu MATE 20.04 - утилита управления микропрограммами устройств, поддерживающих LVFS**

source: ### Window Manager improvements
ru: ### Улучшение менеджера окон

source: Marco is the Window Manager for MATE Desktop and in Ubuntu MATE 20.04 it brings a number of new features and fixes.
ru: Менеджер окон рабочего стола MATE имеет название Marco и в Ubuntu MATE 20.04 он содержит множество новых функций и исправлений.

source: **XPresent support is properly fixed**, which means that **screen tearing is now a thing of the past** and **invisible window corners are finally here!** Invisible window corners mean that windows can be easily resized :straight_ruler: without having to precisely grab the window corners. **HiDPI rendering improvements** fix a number of rendering problems that were present in various themes and components. **Most notably, windows controls are now HIDPI aware**.
ru: **Поддержка XPresent была должным образом исправлена**, что означает **уход в прошлое экранных разрывов** и **позволило окончательно задействовать невидимые углы окон!!** Применение невидимых углов окон позволяет изменять размер окна :straight_ruler: без необходимости точного попадания в из углы. **Улучшение отображения для HiDPI** позволило решить ряд проблем отображения, которые присутствовали в различных темах и компонентах, **в особенности в тех, что учитывают HIDPI**.

source: * Magnus (see below) provides screen magnification * Marco supports invisible windows borders * Marco has improved <kbd>Alt</kbd> + <kbd>Tab</kbd> behaviour * Marco is free from screen tearing * Marco frame performance when gaming is further improved
ru: * Magnus (смотрите ниже) предоставляет увеличение экрана * Marco поддерживает невидимые границы окон * Marco предоставляет улучшенное поведение <kbd>Alt</kbd> + <kbd>Tab</kbd> * Marco больше не имеет проблем с экранными разрывами * Marco имеет улучшенную кадровую производительность для игр

source: **Minimized Application Preview**
ru: **Предварительный просмотр свернутого приложения**

source: Minimized applications in the window list now present a thumbnail preview.
ru: Свернутые приложения в списке окон теперь имеют предварительный просмотр эскизов.

source: {:.center} ![Minimized Preview](/images/blog/focal/taskbar-preview.png)
ru: {:.center} ![Предварительный просмотр свернутого приложения](/images/blog/focal/taskbar-preview.png)

source: **Alt+Tab navigation** makes it possible to traverse the application switcher via keyboard and mouse. <kbd>Alt</kbd> + <kbd>Tab</kbd>.
ru: **Навигация с помощью Alt+Tab** позволяет перемещаться по переключателю приложений с помощью клавиатуры и мыши. <kbd>Alt</kbd> + <kbd>Tab</kbd>.

source: {:.center} ![Alt-Tab Switcher](/images/blog/focal/alt-tab.png)
ru: {:.center} ![Переключение окон по Alt-Tab](/images/blog/focal/alt-tab.png)

source: **Workspace Switcher** allows you to switch between workspaces using a the keyboard and mouse. <kbd>Alt</kbd> + <kbd>Tab</kbd> + <kbd>Ctrl</kbd>.
ru: **Переключатель рабочих мест** позволяет вам переключаться между рабочими местами с помощью клавиатуры и мыши. <kbd>Alt</kbd> + <kbd>Tab</kbd> + <kbd>Ctrl</kbd>.

source: {:.center} ![Workspace Switcher](/images/blog/focal/workspace-switcher.png)
ru: {:.center} ![Переключатель рабочих мест](/images/blog/focal/workspace-switcher.png)

source: **Compiz and Compton have been removed from the default Ubuntu MATE install**. The fundamental reasons for including them no longer exist.Only having one window manager to target means we can promptly deliver new features and minimise development effort. Which brings us to...
ru: **Compiz и Compton были удалены из стандартной поставки Ubuntu MATE**. Основных причин для их включения больше не существует. Наличие только одного оконного менеджера означает, что мы можем оперативно предоставлять новые функции и минимизировать усилия по разработке. Что подводит нас к ...

source: ### New Key-bindings
ru: ### Новые сочетания клавиш

source: The key-bindings for window tiling have only worked on full keyboards :keyboard: with a 10-key pad. Few laptops :computer: have a 10-key pad and not all keyboards have a 10-key either. There are some well known key-bindings from other platforms that were not recognised in Ubuntu MATE. So, we've had a think :think: and have come up with this:
ru: Раньше сочетания клавиш для перемещения окон работали только на полных клавиатурах :keyboard: с блоком 10 цифровых клавиш. Только некоторые ноутбуки :computer: имеют такой блок из 10 клавиш, и не все клавиатуры имеют такой блок. Кроме того, на других платформах существуют хорошо известные сочетания клавиш, которые не распознаются в Ubuntu MATE. Поэтому, подумав :think: мы пришли к следующим сочетаниям клавиш:

source: * **Maximise Window:** <kbd>Super</kbd> + <kbd>Up</kbd> * **Restore Window:** <kbd>Super</kbd> + <kbd>Down</kbd> * **Title Window right:** <kbd>Super</kbd> + <kbd>Right</kbd> * **Title Window left:** <kbd>Super</kbd> + <kbd>Left</kbd> * **Center Window:** <kbd>Alt</kbd> + <kbd>Super</kbd> + <kbd>c</kbd> * **Title Window to upper right corner:** <kbd>Alt</kbd> + <kbd>Super</kbd> + <kbd>Right</kbd> * **Title Window to upper left corner:** <kbd>Alt</kbd> + <kbd>Super</kbd> + <kbd>Left</kbd> * **Title Window to lower right corner:** <kbd>Shift</kbd> + <kbd>Alt</kbd> + <kbd>Super</kbd> + <kbd>Right</kbd> * **Title Window to lower left Corner:** <kbd>Shift</kbd> + <kbd>Alt</kbd> + <kbd>Super</kbd> + <kbd>Left</kbd> * **Shade Window:** <kbd>Control</kbd> + <kbd>Alt</kbd> + <kbd>s</kbd>
ru: * **Развернуть на весь экран:** <kbd>Super</kbd> + <kbd>Up</kbd> * **Восстановить прежний размер:** <kbd>Super</kbd> + <kbd>Down</kbd> * **Переместить окно на правую половину экрана:** <kbd>Super</kbd> + <kbd>Right</kbd> * **Переместить окно на левую половину экрана:** <kbd>Super</kbd> + <kbd>Left</kbd> * **Центрировать окно:** <kbd>Alt</kbd> + <kbd>Super</kbd> + <kbd>c</kbd> * **Переместить окно в верхний правый угол:** <kbd>Alt</kbd> + <kbd>Super</kbd> + <kbd>Right</kbd> * **Переместить окно в верхний левый угол:** <kbd>Alt</kbd> + <kbd>Super</kbd> + <kbd>Left</kbd> * **Переместить окно в нижний правый угол:** <kbd>Shift</kbd> + <kbd>Alt</kbd> + <kbd>Super</kbd> + <kbd>Right</kbd> * **Переместить окно в нижний левый угол:** <kbd>Shift</kbd> + <kbd>Alt</kbd> + <kbd>Super</kbd> + <kbd>Left</kbd> * **Свернуть окно в полоску:** <kbd>Control</kbd> + <kbd>Alt</kbd> + <kbd>s</kbd>

source: It is now possible to tile a window to all screen quadrants :triangular_ruler: using any keyboard form factor. We updated the application launcher key-bindings, some of these have existed in Ubuntu MATE for a while:
ru: Теперь возможно расположить окно в любом квадранте экрана :triangular_ruler: с помощью любого форм-фактора клавиатуры. Мы обновили сочетания клавиш для запуска приложений, некоторые из которых уже давно существуют в Ubuntu MATE:

source: * **Cycle external displays:** <kbd>Super</kbd> + <kbd>P</kbd> * **Lock Screen:** <kbd>Super</kbd> + <kbd>L</kbd> * **Screenshot a rectangle:** <kbd>Shift</kbd> + <kbd>PrintScr</kbd> * **Open File Manager:** <kbd>Super</kbd> + <kbd>e</kbd> * **Open Terminal:** <kbd>Super</kbd> + <kbd>T</kbd> * **Open Control Center:** <kbd>Super</kbd> + <kbd>I</kbd> * **Open Search:** <kbd>Super</kbd> + <kbd>S</kbd> * **Open Task Manager:** <kbd>Control</kbd> + <kbd>Shift</kbd> + <kbd>Escape</kbd> * **Open System Information:** <kbd>Super</kbd> + <kbd>Pause</kbd>
ru: * **Переключение между внешними экранами:** <kbd>Super</kbd> + <kbd>P</kbd> * **Блокировка сеанса:** <kbd>Super</kbd> + <kbd>L</kbd> * **Экранный снимок прямоугольной области:** <kbd>Shift</kbd> + <kbd>PrintScr</kbd> * **Открытие Файлового менеджера Caja:** <kbd>Super</kbd> + <kbd>E</kbd> * **Открытие Терминала:** <kbd>Super</kbd> + <kbd>T</kbd> * **Открытие Центра управления:** <kbd>Super</kbd> + <kbd>I</kbd> * **Открытие Поиска:** <kbd>Super</kbd> + <kbd>S</kbd> * **Открытие Системного монитора:** <kbd>Control</kbd> + <kbd>Shift</kbd> + <kbd>Escape</kbd> * **Открытие информации о Системе:** <kbd>Super</kbd> + <kbd>Pause</kbd>

source: The key-bindings compliment existing well established alternatives. So if <kbd>Ctrl</kbd> + <kbd>Alt</kbd> + <kbd>T</kbd> (Terminal) and <kbd>Ctrl</kbd> + <kbd>Alt</kbd> + <kbd>L</kbd> (Lock Screen) are ingrained in your muscle :muscle: memory 🧠 they are still available too. You can find all the keyboard shortcuts documented in the **Getting Started section of Ubuntu MATE Welcome**.
ru: Сочетания клавиш хорошо дополняют существующие хорошо зарекомендовавшие себя альтернативы. Поэтому если <kbd>Ctrl</kbd> + <kbd>Alt</kbd> + <kbd>t</kbd> (Терминал) and <kbd>Ctrl</kbd> + <kbd>Alt</kbd> + <kbd>L</kbd> (Блокировка сеанса) укоренились в вашей мышечной 💪 памяти 🧠 , то они по-прежнему доступны. Вы можете найти все сочетания клавиш в разделе документации **Начало работы внутри приложения Добро пожаловать (Ubuntu MATE Welcome)**.

source: ### Brisk Menu
ru: ### Меню Brisk

source: [Brisk Menu](https://github.com/getsolus/brisk-menu) is under the Solus GitHub organisation, but it's been a couple of years since it had a new release. The Solus Project gave me administrative access :trident: to the Brisk Menu repo and I've made a new release. Thanks to the efforts of a couple of Ubuntu MATE contributors, several bug :bug: fixes have landed too, which includes **resolving frequent crashers :bomb: in Brisk Menu, preventing a scrollbar always appearing in the category column** of the menu, **silencing sounds firing as you rollover menu entries** and **adding keyboard :keyboard: navigation**.
ru: [Меню Brisk](https://github.com/getsolus/brisk-menu) находится в ведении организации Solus на GitHub, но с момента выхода новой версии прошло уже пару лет. Проект Solus предоставил мне административный доступ :trident: к репозиторию меню Brisk, и я выпустил новую версию. Благодаря усилиям пары участников сообщества Ubuntu MATE были исправлены несколько ошибок :bug: , в том числе **устранение частых сбоев :bomb: меню Brisk, предотвращающих появление полосы прокрутки в столбце категорий** меню, **отключение звуков при наведении курсора мыши на пункты меню** и **добавление клавиатурной :keyboard: навигации**.

source: ### MATE Panel
ru: ### Панель MATE

source: MATE Panel has had a long-standing bug fixed that caused it to crash :boom: when the panel was reset or replaced. This was most noticeable when switching panel layouts via MATE Tweak and could result in the panel layout being left incomplete or entirely absent. This bug is now fixed! MATE Tweak has been updated to neatly integrate with with fixed MATE Panel behaviour so that **layout switching is now 100% reliable**.
ru: В панели MATE была исправлена давняя ошибка, приводившая к сбою :boom: при при сбросе или замене панели. Это было наиболее заметно при переключении макетов панелей с помощью MATE Tweak и могло привести к тому, что макет панели получался неполным или полностью отсутствовал. Эта ошибка исправлена! Программа MATE Tweak была для аккуратной интеграции изменений панелей MATE, так что **переключение макета теперь на 100% надежно**.

source: ### Indicators
ru: ### Индикаторы

source: A bug which resulted in **oversized icons in indicators is finally resolved**.
ru: Ошибка, приводящая к **отображению гигантских пиктограмм и индикаторов окончательноисправлена**.

source: {:.center .transparent} | ![Before](/images/blog/eoan/indicators-before.png) | ![After](/images/blog/eoan/indicators-after.png) | **Before** :poop: | **After** :heart_eyes:
ru: {:.center .transparent} | ![До](/images/blog/eoan/indicators-before.png) | ![После](/images/blog/eoan/indicators-after.png) | **До** :poop: | **После** :heart_eyes:

source: However, it turned out some of the bugs were due to the icons :art: themselves. Over :100: icons have been refactored :paintbrush:️ to correct their resolutions or aspect ratio; as a result the panel and indicators both scale correctly.
ru: Однако, выяснилось, что некоторые ошибки вызваны самими пиктограммами :art: . Более :100: пиктограмм было переработано :paintbrush: для исправления их разрешения или соотношения сторон; в результате панель и индикаторы масштабируются прaвильно.

source: A race condition that could result in **two network status icons being displayed is fixed**, and **when connected via VPN, lock icons are now overlayed on the Network Indicator**. The battery :battery: indicator is improved and now has a larger **charging symbol while charging**.
ru: Состояние гонки, которое могло привести к **появлению двух индикаторов состояния сети** было исправлено, и **при подключении через VPN, пиктограммы замков теперь помещаются над индикатором сети**. Индикатор батареи :battery: улучшен - теперь он имеет **больший размер при зарядке**.

source: We've **added the Date/Time Indicator and integrated it with MATE Desktop and it now replaces the MATE clock applet** which corrects the placement of the clock and session indicators.
ru: Мы **добавили индикатор даты/времени и интегрировали его в рабочий стол MATE, теперь он заменяет апплет часов MATE**, что позволило исправить взаимное расположение часов и индикатора сессии.

source: We've finally addressed a long standing issue which has been around since Ubuntu MATE 14.10 🕸️: some of the monochrome symbolic icons used in the indicators were also used in applications. The presented a couple of issues:
ru: Мы наконец-то решили давнюю проблему, которая существует с Ubuntu MATE 14.10 🕸️: некоторые монохромные символические пиктограммы, используемые в индикаторах, также использовались и в приложениях. Это создавало две следующих проблемы:

source: * In certain cases, you couldn't easily see the icons against the window base colour. * The mix of monochrome and full colour icons in applications looked inconsistent.
ru: * В некоторых случая вы не могли легко увидеть пиктограммы на фоне основного цвета окна. * Сочетание монохромных и полноцветных пиктограмм выглядело несовместимым.

source: This issue is now resolved; **monochrome symbolic icons are only used for indicators and full colour icons are used in the Control Center, Sound Preferences, Bluetooth, OSD, etc**.
ru: Теперь эта проблема решена, **монохромные символические пиктограммы теперь используются только в индикаторах, в то время как полноцветные - в Центре управления, настройках звука, настройках Bluetooth, OSD, и др**.

source: ### MATE Window Applets
ru: ### Оконные апплеты MATE

source: [MATE Window Applets](https://github.com/ubuntu-mate/mate-window-applets) have received a number of bug fixes and new features from a community contributor. Window control icons now dynamically load from the currently selected theme, rather than requiring manual user configuration. **A number of bugs (including significant memory leaks) have also been resolved**.
ru: [Оконные апплеты MATE](https://github.com/ubuntu-mate/mate-window-applets) получили множество исправлений ошибок и новых функций от нашего участника сообщества. Пиктограммы элементов управления окнами теперь загружаются динамически для выбранной темы и теперь не требуют пользовательской настройки, и также **исправлено множество ошибок (включая серьезные утечки памяти)**.

source: ## Notification Center
ru: ## Центр уведомлений
