Repository: aytvill/ubuntu-mate.org
Catalog: _i18n/*/download.po
Languages: ru

source: title: Download
ru: title: Загрузка

source: arch: - name: "64-bit PCs/Macs" icon: images/fa/desktop.svg desc: Bring the MATE experience to your desktop or laptop computer. id: amd64
ru: arch: - name: "64-бит ПК/Mac" icon: images/fa/desktop.svg desc: Принесите опыт MATE на ваш настольный компьютер или ноутбук. id: amd64

source: - name: "32-bit PCs and older Intel Macs" icon: images/fa/desktop.svg desc: For older hardware based on i386. Supported until April 2021. id: i386
ru: - name: "32-бит ПК и более старые Mac на процессорах Intel" icon: images/fa/desktop.svg desc: Для более старых i386 компьютеров. Поддержка до апреля 2021 года. id: i386

source: products: - name: Entroware icon: images/brands/entroware.svg url: /shop/computers/ desc: Purchase a new Ubuntu MATE computer.
ru: products: - name: Entroware icon: images/brands/entroware.svg url: /shop/computers/ desc: Купить новый компьютер с Ubuntu MATE.

source: ports: - name: Raspberry Pi icon: images/brands/rpi-outline.svg desc: '32-bit. Compatible with models: B2, B3, B3+ and B4' id: armhf
ru: ports: - name: Raspberry Pi icon: images/brands/rpi-outline.svg desc: '32-бит. Совместимо с моделями: B2, B3, B3+ и B4' id: armhf

source: - name: Raspberry Pi icon: images/brands/rpi-outline-64.svg desc: '64-bit. Compatible with models: B3, B3+ and B4' id: arm64
ru: - name: Raspberry Pi icon: images/brands/rpi-outline-64.svg desc: '64-бит. Совместимо с моделями: B3, B3+ и B4' id: arm64

source: - name: GPD Pocket icon: images/fa/laptop.svg desc: Optimised for this hardware. id: gpd_pocket
ru: - name: GPD Pocket icon: images/fa/laptop.svg desc: Оптимизация под это устройство. id: gpd_pocket

source: - name: GPD Pocket 2 and GPD WIN 2 icon: images/fa/laptop.svg desc: Plus OneMix Yoga 1s and OneMix Yoga 2 id: gpd_pocket_2
ru: - name: GPD Pocket 2 и GPD WIN 2 icon: images/fa/laptop.svg desc: Plus OneMix Yoga 1s и OneMix Yoga 2 id: gpd_pocket_2

source: - name: GPD Micro PC icon: images/fa/laptop.svg desc: Optimised for this hardware. id: gpd_micropc
ru: - name: GPD Micro PC icon: images/fa/laptop.svg desc: Оптимизация под это устройство. id: gpd_micropc

source: - name: GPD P2 Max icon: images/fa/laptop.svg desc: Optimised for this hardware. id: gpd_p2_max
ru: - name: GPD P2 Max icon: images/fa/laptop.svg desc: Оптимизация под это устройство. id: gpd_p2_max

source: - name: Topjoy Falcon icon: images/fa/laptop.svg desc: Optimised for this hardware. id: gpd_p2_max
ru: - name: Topjoy Falcon icon: images/fa/laptop.svg desc: Оптимизация под это устройство. id: gpd_p2_max
