Repository: aytvill/ubuntu-mate.org
Catalog: _i18n/*/index.po
Languages: ru

source: title: Ubuntu MATE | For a retrospective future
ru: title: Ubuntu MATE | Для ретроспективного будущего

source: banner_title: For a retrospective future.
ru: banner_title: Для ретроспективного будущего

source: banner_subtitle: A community developed, Ubuntu based operating system that beautifully integrates the MATE desktop.
ru: banner_subtitle: Разрабатываемая сообществом, основанная на Ubuntu система, красиво интегрирующая среду рабочего стола MATE.

source: banner_label: Learn more
ru: banner_label: Узнать больше

source: # In a nutshell...
ru: # Короче говоря...

source: Ubuntu MATE is a stable, easy-to-use operating system with a configurable desktop environment. It is ideal for those who want the most out of their computers and prefer a traditional desktop metaphor. With modest hardware requirements it is suitable for modern workstations, single board computers and older hardware alike. Ubuntu MATE makes modern computers fast and old computers usable.
ru: Ubuntu MATE - это стабильная, простая в использовании операционная система с настраиваемой средой рабочего стола. Она идеально подходит для пользователей, которые хотят получить максимум от своих компьютеров при использовании традиционной классической метафоры рабочего стола. Со скромными требованиями к оборудованию она подходит как для современных рабочиx станций, так и для одноплатных компьютеров и различного более старого оборудования. Ubuntu MATE делает современные компьютеры быстрыми, а старые - удобными.

source: # Screenshots
ru: # Экранные снимки

source: Here are some screenshots of the desktop layouts included in Ubuntu MATE to give you a feel for how you can configure your desktop experience.
ru: Вот несколько скриншотов макетов рабочего стола, включенных в Ubuntu MATE, чтобы вы почувствовали, как вы можете настроить свой рабочий стол.

source: # Raspberry Pi & GPD Pocket
ru: # Raspberry Pi и GPD Pocket

source: We are delighted to provide ready-to-run images for the Raspberry Model B 2, 3, 3+ and 4 as well as a range of UMPCs such as the GPD Pocket, GPD Pocket 2, GPD MicroPC and Topjoy Falcon; some of which are available on Amazon. **Learn more of the features they support:**
ru: Мы рады предложить вам готовые к запуску образы системы для Raspberry Model B 2, 3, 3+ и 4 вместе с широким диапазоном ультра-портативных компьютеров (УМПК), таких как GPD Pocket, GPD Pocket 2, GPD MicroPC и Topjoy Falcon; часть из которых доступна на Amazon. **Узнайте больше о предоставляемых ими возможностях:**

source: # Sponsors
ru: # Спонсоры

source: Ubuntu MATE is kindly supported by these fine sponsors and [our awesome Patrons](https://www.patreon.com/ubuntu_mate), such as our Level 42 Patron, [Andrew Miller](https://www.patreon.com/user/creators?u=2613385).
ru: Ubuntu MATE любезно поддерживается этими прекрасными спонсорами и [нашими замечательными патронами](https://www.patreon.com/ubuntu_mate), такими как патрон 42 уровня, [Эндрю Миллер](https://www.patreon.com/user/creators?u=2613385).

source: Also thanks to our Unlucky Patron, [Darrell Vermilion](https://www.patreon.com/bearstampede/creators).
ru: Также мы благодарим нашего патрона, [Даррелла Вермилиона](https://www.patreon.com/bearstampede/creators).
