Repository: aytvill/ubuntu-mate.org
Catalog: _i18n/*/ports-raspberry-pi.po
Languages: fr

source: # Ubuntu MATE for Raspberry Pi
fr: # Ubuntu MATE pour Raspberry Pi

source: Ubuntu MATE 20.04 is available for Raspberry Pi with separate images for `armhf` (ARMv7 32-bit) and `arm64` (ARMv8 64-bit). We have done what we can to optimise the builds for the Raspberry Pi without sacrificing the full desktop environment Ubuntu MATE provides on PC.
fr: Ubuntu MATE 20.04 est disponible pour le Raspberry Pi avec des images séparées pour `armhf` (ARMV7 32-bit) et `arm64` (ARMv8 64-bit). Nous avons fait ce que nous avons pu pour optimiser ces versions pour le Raspberry Pi sans sacrifier l'environnement de bureau Ubuntu MATE auquel nous sommes habitués sur PC.

source: Ubuntu MATE for the Raspberry Pi provides a complete, familiar, desktop environment that can be used for basic desktop computing. It is also of interest to makers and device hackers who want to target [Ubuntu](https://ubuntu.com) for their projects. You can prototype homebrew ARMv7 or ARMv8 based IoT devices in a comfortable desktop environment, including building and testing your apps as [snaps](https://snapcraft.io). The full Ubuntu archive is available to you.
fr: Ubuntu MATE pour Raspberry Pi fournit un environnement de bureau familier et complet qui peut être utilisé pour des tâches informatiques basiques. Il est également digne d'intérêt pour les fabricants et les bidouilleurs qui ciblent [Ubuntu](https://ubuntu.com) pour leurs projets. Vous pouvez créer des prototypes maison d'objets connectés basés sur ARMv7 ou ARMv8 dans un environnement de bureau confortable, y compris créer et tester vos applications en tant que [snaps](https://snapcraft.io). L'archive complète d'Ubuntu est disponible pour vous.

source: For hobbyist projects, you can stick with Ubuntu MATE for "deployment". But, if you have something more professional in mind then the applications and snaps you've prototyped with Ubuntu MATE can be used with [Ubuntu Server](https://ubuntu.com/download/raspberry-pi) or [Ubuntu Core](https://www.ubuntu.com/core). You might want to check out the [Ubuntu Appliance Portfolio](https://ubuntu.com/appliance) too.
fr: Pour des projets d'amateurs, vous pouvez rester avec Ubuntu MATE pour le "déploiement". Mais, si vous avez quelque chose de plus professionnel à l'esprit, alors les applications et snaps dont vous avez fait un prototype avec Ubuntu MATE peuvent être utilisées avec [Ubuntu Server](https://ubuntu.com/download/raspberry-pi) ou [Ubuntu Core](https://www.ubuntu.com/core). Peut-être voudrez-vous aussi jeter un œil au [Portfolio de dispositifs d'Ubuntu](https://ubuntu.com/appliance).

source: ## Features
fr: ## Fonctionnalités

source: High-level features of these images are:
fr: Les fonctionnalités de haut niveau de ces images sont:

source: * Ubuntu kernel. * Performance optimised by the Ubuntu Kernel team. * Regularly security patches by the Ubuntu Security team. * VC4/V3D (fkms) driver is enabled by default. * `fbturbo` driver is available if you want it, but limited to 2D accelerated window moving/scrolling on Raspberry Pi (using the BCM2835 DMA Controller). * Automatic online filesystem expansion. * Ethernet & WiFi (*where available*) * Bluetooth (*where available*) * Audio out via 3.5mm analog audio jack or HDMI * Video out via Composite or HDMI * GPIO access via [GPIO Zero](https://gpiozero.readthedocs.io) and [WiringPi](http://wiringpi.com/). * Support for [USB Booting](https://www.raspberrypi.org/documentation/hardware/raspberrypi/bootmodes/msd.md) is available for Ubuntu MATE 20.10 or newer. * Automatic first-boot file system resizing. * First-boot setup wizard guides you through creating a user account and configuring WiFi.
fr: * Noyau d'Ubuntu . * Performances optimisées par l'équipe du Noyau d'Ubuntu. * Patchs de sécurité fréquents par l'équipe Sécurité d'Ubuntu Security. * Le pilote VC4/V3D (fkms) est activé par défaut. * Le pilote `fbturbo` est disponible si vous le souhaitez, mais limité au déplacement/défilement des fenêtres accéléré en 2D sur Raspberry Pi (utilisant le contrôleur BCM2835 DMA). * Expansion automatique en ligne du système de fichiers. * Ethernet & WiFi (*si disponible*) * Bluetooth (*si disponible*) * Sortie audio par le jack audio analogique 3.5mm ou HDMI * Sortie vidéo par Composite ou HDMI * GPIO access par [GPIO Zero](https://gpiozero.readthedocs.io) and [WiringPi](http://wiringpi.com/). * Prise en charge du [démarrage par USB](https://www.raspberrypi.org/documentation/hardware/raspberrypi/bootmodes/msd.md) est disponible depuis Ubuntu MATE 20.10. * Redimensionnement automatique du système de fichiers au premier démarrage.. * L'assistant de mise en route au premier démarrage vous guide pour la création d'un compte utilisateur et la configuration du WiFi.

source: <!-- * Hardware acceleration: * `ffmpeg` has hardware assisted video decoding and encoding. * VLC has hardware assisted video decoding. * Additional software: * [Steam Link](https://support.steampowered.com/kb_article.php?ref=6153-IFGH-6589) is available for install. * [Minecraft: Pi Edition](https://projects.raspberrypi.org/en/projects/getting-started-with-minecraft-pi) is available for install. -->
fr: <!-- * Accélération matérielle: * `ffmpeg` dispose de l'accélération matérielle pour le décodage et l'encodage des vidéos. * VLC dispose de l'accélération matérielle pour le décodage des vidéos. * Logiciels additionnels * [Steam Link](https://support.steampowered.com/kb_article.php?ref=6153-IFGH-6589) est disponible à l'installation. * [Minecraft: Pi Edition](https://projects.raspberrypi.org/en/projects/getting-started-with-minecraft-pi) est disponible à l'installation. -->

source: {:.center .small} ![Ubuntu MATE running on the Raspberry Pi 4](/images/ports/09_raspberrypi.png) **Ubuntu MATE running on the Raspberry Pi 4**
fr: {:.center .small} ![Ubuntu MATE sur le Raspberry Pi 4](/images/ports/09_raspberrypi.png) **Ubuntu MATE sur le Raspberry Pi 4**

source: ## Supported Raspberry Pi
fr: ## Raspberry Pi pris en charge

source: * These images work on: * [Raspberry Pi 4 Model B](https://www.raspberrypi.org/products/raspberry-pi-4-model-b/) **(recommended)** * [Compute Module 4](https://www.raspberrypi.org/products/compute-module-4/?variant=raspberry-pi-cm4001000) in a [Compute Module 4 IO Board](https://www.raspberrypi.org/products/compute-module-4-io-board/) **(recommended)** * A **Raspberry Pi 4 and Compute Module 4 with 2GB RAM or more** offers the best experience. * [Raspberry Pi 3 Model B+](https://www.raspberrypi.org/products/raspberry-pi-3-model-b-plus/) **(not recommended)** * With just 1GB of RAM, everything works but desktop use is hampered by memory pressure.
fr: * Ces images fonctionnent sur: * [Raspberry Pi 4 Model B](https://www.raspberrypi.org/products/raspberry-pi-4-model-b/) **(recommandé)** * [Compute Module 4](https://www.raspberrypi.org/products/compute-module-4/?variant=raspberry-pi-cm4001000) dans une [Carte Compute Module 4 IO](https://www.raspberrypi.org/products/compute-module-4-io-board/) **(recommandé)** * Un **Raspberry Pi 4 et Compute Module 4 avec 2GO RAM ou plus** offrent la meilleure expérience. * [Raspberry Pi 3 Model B+](https://www.raspberrypi.org/products/raspberry-pi-3-model-b-plus/) **(pas recommandé)** * Avec seulement 1GO de RAM, tout fonctionne mais le bureau est accablé par la pression de la mémoire.

source: ## Unsupported Raspberry Pi
fr: ## Raspberry Pi non pris en charge

source: * These images *kind of* work on: * [Raspberry Pi 3 Model B](https://www.raspberrypi.org/products/raspberry-pi-3-model-b/) **(not recommended)** * [Raspberry Pi 3 Model A+](https://www.raspberrypi.org/products/raspberry-pi-3-model-a-plus/) **(not recommended)** * [Raspberry Pi 2 Model B](https://www.raspberrypi.org/products/raspberry-pi-2-model-b/) **(not recommended)** * Fails to complete the first boot setup due to insufficient memory. * If you have completed the setup on another Pi that card can be inserted in a Pi 3 Model A+ and it will work. * Due to only having 512MB RAM the `arm64` is not recommended; even the `armhf` version can be very tight on resources.
fr: * Ces images fonctionnent "plus ou moins" sur: * [Raspberry Pi 3 Model B](https://www.raspberrypi.org/products/raspberry-pi-3-model-b/) **(pas recommandé)** * [Raspberry Pi 3 Model A+](https://www.raspberrypi.org/products/raspberry-pi-3-model-a-plus/) **(pas recommandé)** * [Raspberry Pi 2 Model B](https://www.raspberrypi.org/products/raspberry-pi-2-model-b/) **(pas recommandé)** * N'arrive pas à terminer le premier réglage du démarrage du fait d'une insuffisance de mémoire. * Si vous avez terminé l'installation sur un autre Pi, cette carte pourra être insérée dans un Pi 3 Modèle A+ et ça fonctionnera. * Du fait des 512MO de RAM, l'`arm64` n'est pas recommandée; même la version `armhf` peut être vraiment limitée en ressources.

source: * These images **will not work on** any Raspberry Pi model using an ARMv6 instruction set: * [Raspberry Pi 1 Model A+](https://www.raspberrypi.org/products/raspberry-pi-1-model-a-plus/) * [Raspberry Pi 1 Model B+](https://www.raspberrypi.org/products/raspberry-pi-1-model-b-plus/) * [Raspberry Pi Zero](https://www.raspberrypi.org/products/raspberry-pi-zero/) * [Raspberry Pi Zero W](https://www.raspberrypi.org/products/raspberry-pi-zero-w/)
fr: * Ces images ne **fonctionneront pas** sur tout modèle de Raspberry Pi utilisant un jeu d'instructions ARMv6: * [Raspberry Pi 1 Model A+](https://www.raspberrypi.org/products/raspberry-pi-1-model-a-plus/) * [Raspberry Pi 1 Model B+](https://www.raspberrypi.org/products/raspberry-pi-1-model-b-plus/) * [Raspberry Pi Zero](https://www.raspberrypi.org/products/raspberry-pi-zero/) * [Raspberry Pi Zero W](https://www.raspberrypi.org/products/raspberry-pi-zero-w/)

source: Memory pressure is reasonable using the `armhf` images (~350MB at idle) but quite tight on the `arm64` images (~490MB at idle). As always, microSDHC I/O throughput is a bottleneck on the Raspberry PPi so don't gimp your Raspberry Pi by cheaping out on poor performing microSDHC cards. We used the [Samsung EVO Plus 32 GB microSDHC UHS-I U1](https://geni.us/AKAsg) and [Kingston 64 GB microSDXC Canvas Go Plus](https://geni.us/Jelmu) during the testing of these images and they significantly better performance than most other microSDHC cards we've tried. [But don't take our word for it](https://www.pidramble.com/wiki/benchmarks/microsd-cards).
fr: La pression mémoire est raisonnable en utilisant les images `armhf` (~350MO au repos) mais plutôt tendue sur les images `arm64` (~490MO au repos). Comme toujours, le débit I/O de la microSDHC est un goulet d'étranglement sur le Raspberry Pi, alors ne n'accablez pas votre Raspberry Pi en étant radin sur la qualité des cartes microSDHC. Nous avons utilisé la [Samsung EVO Plus 32 GB microSDHC UHS-I U1](https://geni.us/AKAsg) et la [Kingston 64 GB microSDXC Canvas Go Plus](https://geni.us/Jelmu) durant les tests de ces images et elles montraient des performances bien supérieures à la plupart des autres cartes microSDHC que nous avons essayées. [Mais ne nous croyez pas sur parole](https://www.pidramble.com/wiki/benchmarks/microsd-cards).

source: You'll need a microSD card which is **8GB** or greater to fit the image. The file system will automatically resize to occupy the unallocated space of the microSD card. Here is our recommended kit lists on Amazon:
fr: Vous aurez besoin d'une carte microSD de **8GO** ou plus pour faire tenir les images. Votre système de fichiers sera automatiquement redimensionné pour occuper l'espace non alloué de la carte MicroSD. Voici notre liste recommandée de kits sur Amazon:

source: ### Raspberry Pi 4 with 8GB RAM
fr: ### Raspberry Pi 4 avec 8GO RAM

source: {:.transparent .icons} |Raspberry Pi 4 8GB RAM|Argon One Case|SanDisk Extreme 128 GB microSDXC| |[![Raspberry Pi 4 8GB RAM](/images/ports/pi4-8GB.jpg)](https://geni.us/QjSiQA6)|[![Argon One Case](/images/ports/argon-one.webp)](https://geni.us/lvbbi8n)|[![SanDisk Extreme 128 GB microSDXC](/images/ports/SanDiskExtreme.jpg)](https://geni.us/oRQKPJ)|
fr: {:.transparent .icons} |Raspberry Pi 4 8GO RAM|Boitier Argon One|SanDisk Extreme 128 GO microSDXC| |[![Raspberry Pi 4 8GO RAM](/images/ports/pi4-8GB.jpg)](https://geni.us/QjSiQA6)|[![Boitier Argon One](/images/ports/argon-one.webp)](https://geni.us/lvbbi8n)|[![SanDisk Extreme 128 GO microSDXC](/images/ports/SanDiskExtreme.jpg)](https://geni.us/oRQKPJ)|

source: ### Raspberry Pi 4 with 4GB RAM
fr: ### Raspberry Pi 4 avec 4GO RAM

source: {:.transparent .icons} |Raspberry Pi 4 4GB RAM|Argon NEO Case|Kingston 64 GB microSDXC Canvas Go Plus| |[![Raspberry Pi 4 4GB RAM](/images/ports/pi4-4GB.webp)](https://geni.us/wKRpG)|[![Argon NEO Case](/images/ports/argon-neo.webp)](https://geni.us/DcxV)|[![Kingston 64 GB microSDXC Canvas Go Plus](/images/ports/KingstonCanvasGoPlus.webp)](https://geni.us/Jelmu)|
fr: {:.transparent .icons} |Raspberry Pi 4 4GO RAM|Boitier Argon NEO|Kingston 64 GO microSDXC Canvas Go Plus| |[![Raspberry Pi 4 4GO RAM](/images/ports/pi4-4GB.webp)](https://geni.us/wKRpG)|[![Boitier Argon NEO](/images/ports/argon-neo.webp)](https://geni.us/DcxV)|[![Kingston 64 GO microSDXC Canvas Go Plus](/images/ports/KingstonCanvasGoPlus.webp)](https://geni.us/Jelmu)|

source: ### Raspberry Pi 4 with 2GB RAM
fr: ### Raspberry Pi 4 avec 2GO RAM

source: {:.transparent .icons} |Raspberry Pi 4 2GB RAM|Flirc Case|Samsung EVO Plus 32 GB microSDHC UHS-I U1| |[![Raspberry Pi 4 2GB RAM](/images/ports/pi4-2GB.webp)](https://geni.us/GN70L)|[![Flirc Case](/images/ports/flirc.jpg)](https://geni.us/QvssBp)|[![Samsung EVO Plus 32 GB microSDHC UHS-I U1](/images/ports/SamsungEvoPlus.png)](https://geni.us/AKAsg)|
fr: {:.transparent .icons} |Raspberry Pi 4 2GO RAM|Boitier Flirc|Samsung EVO Plus 32 GO microSDHC UHS-I U1| |[![Raspberry Pi 4 2GO RAM](/images/ports/pi4-2GB.webp)](https://geni.us/GN70L)|[![Boitier Flirc](/images/ports/flirc.jpg)](https://geni.us/QvssBp)|[![Samsung EVO Plus 32 GO microSDHC UHS-I U1](/images/ports/SamsungEvoPlus.png)](https://geni.us/AKAsg)|

source: title = "Download" text = "Run Ubuntu MATE on your Raspberry Pi today." button_text = "Download" button_url = "/download/"
fr: title = "Télécharger" text = "Faites tourner Ubuntu MATE sur votre Raspberry Pi aujourd'hui !" button_text = "Télécharger" button_url = "/download/"

source: ## Additional features
fr: ## Fonctionnalités Supplémentaires

source: ### USB Booting
fr: ### Démarrage par USB

source: Ubuntu MATE 20.10 and newer support USB booting, **but Ubuntu MATE 20.04 does not**.
fr: La prise en charge du démarrage par USB est présente depuis Ubuntu 20.10, **contrairement à Ubuntu MATE 20.04 qui ne le permet pas**.

source: If you have a [Compute Module 4](https://www.raspberrypi.org/products/compute-module-4/?variant=raspberry-pi-cm4001000) you can enable the USB2 outputs on the [Compute Module 4 IO Board](https://www.raspberrypi.org/products/compute-module-4-io-board/), assuming your Compute Module is plugged into such a board, by un-commenting the following line in `/boot/firmware/config.txt`.
fr: Si vous disposez d'un [Compute Module 4](https://www.raspberrypi.org/products/compute-module-4/?variant=raspberry-pi-cm4001000) vous pouvez activer les sorties USB2 sur la [Carte Compute Module 4 IO](https://www.raspberrypi.org/products/compute-module-4-io-board/), si votre Compute Module est branché sur une telle carte en décommentant la ligne suivante dans `/boot/firmware/config.txt`.

source: #### Enable USB boot for Raspberry Pi 4
fr: #### Activer le démarrage par USB sur Raspberry Pi 4

source: To enable USB mass storage boot on a Raspberry Pi 4 follow these steps:
fr: Pour activer le démarrage sur un appareil de stockage de grande capacité en USB sur un Raspberry Pi 4, veuillez suivre ces étapes:

source: * [Enable optional USB boot on Raspberry Pi 4](https://ubuntu.com/tutorials/how-to-install-ubuntu-desktop-on-raspberry-pi-4#4-optional-usb-boot)
fr: * [Activer le démarrage optionnel par USB sur Raspberry Pi 4](https://ubuntu.com/tutorials/how-to-install-ubuntu-desktop-on-raspberry-pi-4#4-optional-usb-boot)

source: ### Enable USB boot for Raspberry Pi 2, 3 and 3+
fr: ### Activer le démarrage par USB sur Raspberry Pi 2, 3 et 3+

source: The Raspberry Pi 3, 3+ and Pi 2 v1.2 with the same BCM2837 SoC as the Pi 3, are capable of booting from a USB drive. For the Pi 2 and 3 you'll first need to [program USB boot mode](https://www.raspberrypi.org/documentation/hardware/raspberrypi/bootmodes/msd.md), this is unnecessary on the Pi 3+ as USB booting is enabled by default.
fr: Les Raspberry Pi Pi 3, 3+ et Pi 2 v1.2 avec le même SoC BCM2837 SoC que le Pi 3, peuvent démarrer sur un disque USB. Pour les Pi 2 et 3 vous devez tout d'abord [programmer le mode de démarrage par USB](https://www.raspberrypi.org/documentation/hardware/raspberrypi/bootmodes/msd.md), ce n'est pas nécessaire sur le Pi 3+ comme le démarrage par USB est activé par défaut.

source: The GPU firmware partition is mounted at `/boot/firmware`. The files `/boot/firmware/config.txt` and `/boot/firmware/cmdline.txt` contain the system configuration and kernel command line options respectively.
fr: La partition du firmware GPU est montée à `/boot/firmware`. Les fichiers `/boot/firmware/config.txt` et `/boot/firmware/cmdline.txt` contiennent respectivement la configuration du système et les options en ligne de commande du noyau.

source: The OpenSSH server is not installed by default. Simply install it to to enable SSH.
fr: Le serveur OpenSSH n'est plus installé par défaut. Installez-le simplement pour activer le SSH.

source: If you install SSH then you might also want to install `sshguard` which is highly optimised and well suited for use on the Raspberry Pi to protect from brute force attacks against SSH.
fr: Si vous installez SSH, vous devriez peut-être également installer `sshguard` qui est hautement optimisé et très adapté à l'utilisation sur RaspberryPi pour vous protéger des attaques brute-force contre le SSH.

source: <!-- ### Steam Link for Raspberry Pi
fr: <!-- ### Steam Link pour Raspberry Pi

source: The Steam Link app extends Steam Link functionality to the Raspberry Pi Model B 3 and 3+ and uses the same streaming technology as Valve's Steam Link, allowing you to play your favorite games and even spectate VR games right from your Raspberry Pi.
fr: L'application Steam Link étend la fonctionnalité du Steam Link aux Raspberry Pi Model B 3 et 3 + et utilise la même technologie de diffusion que le Steam Link de Valve, vous permettant de jouer à vos jeux préférés et même assister à des jeux VR dès maintenant sur votre Raspberry Pi.

source: Can be installed via `sudo apt install steamlink`
fr: Peut être installé avec `sudo apt install steamlink`

source: You can learn more about Steam Link for Raspberry Pi from Valve:
fr: Vous pouvez en apprendre plus sur Steam Link pour Raspberry Pi avec Valve:

source: * [Steam Link App for Raspberry Pi](https://support.steampowered.com/kb_article.php?ref=6153-IFGH-6589)
fr: * [App Steam Link Pour Raspberry Pi](https://support.steampowered.com/kb_article.php?ref=6153-IFGH-6589)

source: Minecraft: Pi Edition is a cut down version of Minecraft for the Raspberry Pi. It is based on an old version of Minecraft Pocket Edition and offers language bindings for Python.
fr: Minecraft: Pi Edition est une version allégée de Minecraft pour le Raspberry Pi. Elle est basée sur une vieille version de Minecraft Pocket Edition et propose des liens de langage pour Python.

source: Can be installed via `sudo apt install minecraft-pi`
fr: Peut être installé par `sudo apt install minecraft-pi`

source: You can learn more about how to control the player, manually build with blocks and use the Python interface to manipulate the world around you from the Raspberry Pi Foundation.
fr: Vous pouvez en apprendre plus à propos du contrôle du joueur, construire manuellement avec des blocs et utiliser l'interface Python pour manipuler le monde autour de vous à partir de la fondation Raspberry Pi.

source: * [Getting Started with Minecraft Pi](https://projects.raspberrypi.org/en/projects/getting-started-with-minecraft-pi) -->
fr: * [Démarrer avec Minecraft Pi](https://projects.raspberrypi.org/en/projects/getting-started-with-minecraft-pi) -->

source: ### Redirecting audio output
fr: ### Rediriger la sortie audio

source: If you have issues with audio, you may try un-commenting the following line in `/boot/firmware/config.txt`:
fr: Si vous avez des problèmes avec l'audio, essayez de décommenter la ligne suivante dans `/boot/firmware/config.txt`:

source: This forces the HDMI output into HDMI mode instead of DVI; which doesn't support audio output. You can also configure the system to output to a particular audio device.
fr: Cela force la sortie HDMI en mode HDMI plutôt que DVI: qui ne supporte pas la sortie audio. Vous pouvez également configurer le système pour rediriger la sortie vers un périphérique audio particulier.

source: #### For HDMI
fr: #### Pour l'HDMI

source: #### For 3.5mm audio jack
fr: #### Pour le jack audio 3.5mm

source: <!-- ### Hardware accelerated video
fr: <!-- ### Accélération matérielle des vidéos

source: Most videos will play with hardware acceleration using VLC which is pre-installed in Ubuntu MATE. To use hardware accelerated video playback with `ffplay` you must specify the `h264_mmal` codec.
fr: La plupart des vidéos seront lues en utilisant l'accélération matérielle avec VLC qui est pré-installé dans Ubuntu MATE. Pour utiliser l'accélération matérielle lors de la lecture des vidéos avec `ffplay` vous devez spécifier le codec `h264_mmal` .

source: Hardware accelerated playback on the Raspberry Pi works by overlaying the video directly to the screen. Therefore there are no onscreen controls for playback control. You'll need to use the ffmpeg keyboard shortcuts.
fr: L'accélération matérielle de la lecture sur Raspberry Pi fonctionne en superposant la vidéo directement sur l'écran. De ce fait, il n'y a pas d'affichage des contrôles sur l'écran pour contrôler la lecture. Vous devrez utiliser les raccourcis clavier de ffmpeg.

source: * [ffplay keyboard controls](https://ffmpeg.org/ffplay.html#toc-While-playing)
fr: * [contrôles clavier de ffplay](https://ffmpeg.org/ffplay.html#toc-While-playing)

source: `ffmpeg` also offer hardware enabled video encoding via the `h264_omx` encoder. Here is an example:
fr: `ffmpeg` propose également l'encodage vidéo matériel avec l'encodeur `h264_omx`. Voici un exemple:

source: However if you have MPEG-2 or VC-1 video video files then **you will need MPEG-2 and/or VC-1 licenses from the [Raspberry Pi Store](http://www.raspberrypi.com/license-keys/)**. -->
fr: Toutefois, si vous avez des vidéos en MPEG-2 ou VC-1, **vous aurez besoin des licences MPEG-2 et/ou VC-1 du [magasin Raspberry Pi](http://www.raspberrypi.com/license-keys/)**.

source: ## Recent Changes
fr: ## Changements récents

source: ### Ubuntu MATE 20.04.1 & 20.10 - October 30th 2020
fr: ### Ubuntu MATE 20.04.1 & 20.10 - 30 Octobre 2020
