Repository: aytvill/ubuntu-mate.org
Catalog: _i18n/*/ports-raspberry-pi.po
Languages: fr

source: * Ubuntu MATE 20.10 is capable of USB boot. * Compute Module 4 support. * The `gpio`, `i2c`, `input` and `spi` groups are pre-created. * The user created using the first-boot wizard is automatically added to the groups above. * `cloud-init` is completely removed; file system expansion is handled by `cloud-initramfs-growroot` and the `x-systemd.growfs` mount option. * Snaps are initialized while the first-boot setup wizard runs. * Plymouth splash screen is displayed correctly during first-boot. * Serial console is disabled by default. * `gpu_mem` configured for 128MB by default. * `hdmi_drive` now defaults to DVI mode.
fr: * Ubuntu MATE 20.10 est capable du démarrage par USB. * Prise en charge du Compute Module 4. * Les groupes `gpio`, `i2c`, `input` et `spi` sont pré-créés. * L'utilisateur créé au cours de l'assistant lors du premier démarrage est automatiquement ajouté aux groupes ci-dessus.. * `cloud-init` est complètement supprimé; l'expansion du système de fichier est gérée par `cloud-initramfs-growroot` et l'option de montage `x-systemd.growfs`. * Les snaps sont initialisés durant l'exécution de l'assistant lors du premier démarrage. * L'écran de démarrage Plymouth est affiché correctement lors du premier démarrage. * La console série est désactivée par défaut. * `gpu_mem` est configuré pour 128MO par défaut. * `hdmi_drive` est dorénavant en mode DVI par défaut.

source: ### Ubuntu MATE 20.04.1 Beta 2 - 13 August 2020
fr: ### Ubuntu MATE 20.04.1 Beta 2 - 13 Août 2020

source: * Re-based on Ubuntu MATE 20.04.1. * Fixed WiFi on first boot during the initial setup wizard. * Dropped `gpu_mem` from `config.txt` as the defaults should be sensible.
fr: * Re-basé sur Ubuntu MATE 20.04.1 * Corrigé le WiFi lors du premier démarrage durant l'assistant initial de mise en route. * Abandonné `gpu_mem` de `config.txt` parce que les défauts semblent raisonnables.

source: ### Ubuntu MATE 20.04 Beta 1 - 12 July 2020
fr: ### Ubuntu MATE 20.04 Beta 1 - 12 Juillet 2020

source: * Re-based on Ubuntu MATE 20.04. * Added support for Raspberry Pi 4. * Enabled the VC4/V3D (fkms) driver by default. * Firefox uses Basic rendering by default. * Based on community feedback and our testing the OMTC (OpenGL) compositing video playback is choppy by comparison. * Added `rpi-eeprom`. * Minecraft: Pi Edition is still be packaged. * USB Booting is work in progress. * Dropped `raspi-config`; we have something else in the works...
fr: * Re-basé sur Ubuntu MATE 20.04. * Ajout de la prise en charge du Raspberry Pi 4. * Activé le pilote VC4/V3D (fkms) par défaut. * Firefox utilise le rendu Basic par défat. * Basé sur les commentaires de la communauté et nos tests, la lecture vidéo composite OMTC (OpenGL) est saccadée en comparaison. * Ajouté |rpi-eeprom` . * Minecraft: Pi Edition doit toujours être empaqueté. * Travail en cours sur le démarrage par USB. * Abandonné `raspi-config` : nous avons quelque chose d'autre dans les tuyaux...

source: ### Previous Changes
fr: ### Changement Précédents

source: * [See what changed in earlier releases.](/ports/raspberry-pi-change-log/)
fr: * [Voir les changements dans les versions précédentes.](/ports/raspberry-pi-change-log/)

source: ## Feedback and Improvements
fr: ## Commentaires et Améliorations

source: These images are not official Ubuntu products and are community supported by the Ubuntu MATE team. Please post feedback and issues on the [dedicated community forum](https://ubuntu-mate.community/c/support/raspberry-pi).
fr: Ces images ne sont pas des produits officiels d'Ubuntu et sont supportés au niveau communautaire par l'équipe d'Ubuntu MATE. Veuillez poster vos commentaires et problèmes sur le [forum dédié de la communauté](https://ubuntu-mate.community/c/support/raspberry-pi).
